[{"summary":"Sheriff's deputy Rick Grimes awakens from a coma to find a post-apocalyptic world dominated by flesh-eating zombies. He sets out to find his family and encounters many other survivors along the way.","date":"2010-10-31","imageLink":"\/yn7psGTZsHumHOkLUmYpyrIcA2G.jpg","seasons":[{"air_date":"2010-10-11","overview":"","episode_count":43,"name":"Specials","season_number":0,"id":3646,"poster_path":"\/dJ8jOjIwgG6CybD4X5rTunO4cZ6.jpg"},{"air_date":"2010-10-31","overview":"","episode_count":6,"name":"Season 1","season_number":1,"id":3643,"poster_path":"\/yaOB2Y8GcoXwjNQ3apq67bMbNHF.jpg"},{"air_date":"2011-10-16","overview":"","episode_count":13,"name":"Season 2","season_number":2,"id":3644,"poster_path":"\/wpG9SDyz23t3vU8dTbtSvEkxv8r.jpg"},{"air_date":"2012-10-14","overview":"","episode_count":16,"name":"Season 3","season_number":3,"id":3645,"poster_path":"\/mDVPeQ5ZaaeO2Qh7VlXZchHHuLN.jpg"},{"air_date":"2013-10-13","overview":"","episode_count":16,"name":"Season 4","season_number":4,"id":3647,"poster_path":"\/pLXlKKQOoUZAjWsXwacZCj6SWIb.jpg"},{"air_date":"2014-10-12","overview":"After the season 4 finale left most of the main characters at the mercy of the sadistic inhabitants of Terminus. Season 5 will offer new directions for the group of survivors as scientist Eugene Porter promises a cure to the zombie virus if he can be safely escorted to Washington DC, but getting there is easier said than done.","episode_count":16,"name":"Season 5","season_number":5,"id":60391,"poster_path":"\/oiQbg5WqdHqBWMrtbzJeS6vb2Lt.jpg"},{"air_date":"2015-10-11","overview":"With no hope of safety in Alexandria, Rick's group is forced to resume their precarious fight for survival. In the fight for humanity, many have become inhumane. While the Alexandrians must adapt to the hardness of Rick's group, Rick's group must retreat from their violent ways. This won't happen easily, but now there is more at stake than simply surviving. Rick's group is fighting for a chance at normalcy in a world of chaos.","episode_count":16,"name":"Season 6","season_number":6,"id":68814,"poster_path":"\/kwVAeAA6TlZWr6lRP2yVTyR2aif.jpg"},{"air_date":"2016-10-23","overview":"Rick and his group's world becomes even more brutal due to Negan's deadly example of what happens if they don't live under his rules. Everyone must begin again.","episode_count":16,"name":"Season 7","season_number":7,"id":76834,"poster_path":"\/nO2rbewsaek4J1M6sN3PsS5Sf2C.jpg"},{"air_date":"2017-10-22","overview":"Rick and his survivors bring \"All-Out War\" to Negan and his forces. The Saviors are larger, better-equipped, and ruthless - but Rick and the unified communities are fighting for the promise of a brighter future. The battle lines are drawn as they launch into a kinetic, action-packed offensive.","episode_count":16,"name":"Season 8","season_number":8,"id":91735,"poster_path":"\/wmv0oIun52Xeq65sBKfHiUkiBKc.jpg"},{"air_date":"2018-10-07","overview":"","episode_count":8,"name":"Season 9","season_number":9,"id":109531,"poster_path":"\/5KKovNGmh20sDBnyFyuaYTOSmh8.jpg"}],"rating":7.3,"serieType":[18,10759,10765],"id":1402,"title":"The Walking Dead"},{"summary":"After a particle accelerator causes a freak storm, CSI Investigator Barry Allen is struck by lightning and falls into a coma. Months later he awakens with the power of super speed, granting him the ability to move through Central City like an unseen guardian angel. Though initially excited by his newfound powers, Barry is shocked to discover he is not the only \"meta-human\" who was created in the wake of the accelerator explosion -- and not everyone is using their new powers for good. Barry partners with S.T.A.R. Labs and dedicates his life to protect the innocent. For now, only a few close friends and associates know that Barry is literally the fastest man alive, but it won't be long before the world learns what Barry Allen has become...The Flash.","date":"2014-10-07","imageLink":"\/fki3kBlwJzFp8QohL43g9ReV455.jpg","seasons":[{"air_date":"2016-04-19","overview":"","episode_count":5,"name":"Specials","season_number":0,"id":79954,"poster_path":"\/hce9A21ANLi4n9QtBZEdPFD2eZk.jpg"},{"air_date":"2014-10-07","overview":"","episode_count":23,"name":"Season 1","season_number":1,"id":60523,"poster_path":"\/nOUQ03eFsbvSbQB235YrBRuo00.jpg"},{"air_date":"2015-10-06","overview":"Following the dramatic events of season 1, Team Flash quickly turns their attention to a threat high above Central City. Armed with the heart of a hero and the ability to move at super speeds, will Barry be able to save his city from impending doom?","episode_count":23,"name":"Season 2","season_number":2,"id":66922,"poster_path":"\/pZE6s1yo668pWg7LG4r7TSWnSXG.jpg"},{"air_date":"2016-10-04","overview":"","episode_count":23,"name":"Season 3","season_number":3,"id":77888,"poster_path":"\/qxagPKSYMhyGEgWLkC1NG43uWeN.jpg"},{"air_date":"2017-10-10","overview":"","episode_count":23,"name":"Season 4","season_number":4,"id":90247,"poster_path":"\/zBF3wcUp3SgnlYNOXQeaDg5XfTu.jpg"},{"air_date":"2018-10-10","overview":"","episode_count":4,"name":"Season 5","season_number":5,"id":104777,"poster_path":"\/z3CqL2vnjgLuefOiR5AYD9Tf91S.jpg"}],"rating":6.7,"serieType":[18,10765],"id":60735,"title":"The Flash"},{"summary":"Lawyer-by-day Matt Murdock uses his heightened senses from being blinded as a young boy to fight crime at night on the streets of Hell’s Kitchen as Daredevil.","date":"2015-04-10","imageLink":"\/wVadC1BT2w3hDh5Vq0J0LFFTrLP.jpg","seasons":[{"air_date":"2015-04-10","overview":"Blinded as a young boy, Matt Murdock fights injustice by day as a lawyer and by night as the superhero Daredevil in Hell's Kitchen, New York City.","episode_count":13,"name":"Season 1","season_number":1,"id":64558,"poster_path":"\/zFmJQzl6bFrdpHhDkxXmboyykqD.jpg"},{"air_date":"2016-03-18","overview":"Dark forces are tearing Hell's Kitchen apart once again, but this time Daredevil may have to choose between the city and his friends.","episode_count":13,"name":"Season 2","season_number":2,"id":74182,"poster_path":"\/opHoslNCxkgoCaGhfO66fvCSH83.jpg"},{"air_date":"2018-10-19","overview":"Missing for months, Matt Murdock reemerges a broken man, putting into question his future as both vigilante Daredevil and lawyer Matthew Murdock. But when his archenemy Wilson Fisk is released from prison, Matt must choose between hiding from the world, or embracing his destiny as a hero.","episode_count":13,"name":"Season 3","season_number":3,"id":109592,"poster_path":"\/zH6sgePlr1XX0jSZypbfQmr70Lf.jpg"}],"rating":7.8,"serieType":[28,80],"id":61889,"title":"Marvel's Daredevil"},{"summary":"Follows the personal and professional lives of a group of doctors at Seattle’s Grey Sloan Memorial Hospital.","date":"2005-03-27","imageLink":"\/mgOZSS2FFIGtfVeac1buBw3Cx5w.jpg","seasons":[{"air_date":"2006-01-08","overview":"","episode_count":5,"name":"Specials","season_number":0,"id":3722,"poster_path":"\/97hftic9L28LO57fV5g7PPivysK.jpg"},{"air_date":"2005-03-27","overview":"The first season of the American television medical drama Grey's Anatomy, began airing in the United States on the American Broadcasting Company on March 27, 2005 and concluded on May 22, 2005. The first season introduces the main character, Meredith Grey, as she enrolls in Seattle Grace Hospital's internship program and faces unexpected challenges and surprises. Season one had nine series regulars, six of whom have been part of the main cast ever since. The season initially served as a mid-season replacement for the legal drama Boston Legal, airing in the Sunday night time slot at 10:00, after Desperate Housewives. Although no clip shows have been produced for this season, the events that occur are recapped in \"Straight to Heart\", a clip-show which aired one week before the winter holiday hiatus of the second season ended. The season was officially released on DVD as two-disc Region 1 box set under the title of Grey's Anatomy: Season One on February 14, 2006 by Buena Vista Home Entertainment.\n\nThe season's reviews and critiques were generally positive, and the series received several awards and nominations for the cast and crew. The first five episodes of the second season were conceived, written and shot to air as the final five episodes of the first season, but aired during the 2005-2006 season due to the high number of viewers that watched \"Who's Zoomin' Who?\", the season's highest-rated episode with 22.22 million viewers tuning in.","episode_count":9,"name":"Season 1","season_number":1,"id":3718,"poster_path":"\/foM4ImvUXPrD2NvtkHyixq5vhPx.jpg"},{"air_date":"2005-09-25","overview":"The second season of the American television medical drama Grey's Anatomy commenced airing on the American Broadcasting Company on September 25, 2005, and concluded on May 15, 2006. The season was produced by Touchstone Television, in association with Shondaland production company and The Mark Gordon Company, the showrunner being Shonda Rhimes. Actors Ellen Pompeo, Sandra Oh, Katherine Heigl, Justin Chambers, and T.R. Knight reprised their roles as surgical interns Meredith Grey, Cristina Yang, Izzie Stevens, Alex Karev, and George O'Malley, respectively. Previous main cast members Chandra Wilson, James Pickens, Jr., Isaiah Washington, and Patrick Dempsey also returned, while Kate Walsh, who began the season in a recurring capacity, was promoted to series regular status, after appearing in seven episodes as a guest star.\n\nThe season continued to focus on the surgical residency of five young interns as they try to balance to the challenges of their competitive careers, with the difficulties that determine their personal lives. It was set in the fictional Seattle Grace Hospital, located in the city of Seattle, Washington. Whereas the first season put the emphasis mainly on the unexpected impact the surgical field has on the main characters, the second one provides a detailed perspective on the personal background of each character, focusing on the consequences that their decisions have on their careers. Throughout the season, new story lines were introduced, including the love triangle between Meredith Grey, Derek Shepherd, and Addison Montgomery, the main arc of the season. Also heavily developed was the story line involving Izzie Stevens' relationship with patient Denny Duquette, which resulted in critical acclaim and positive fan response.","episode_count":27,"name":"Season 2","season_number":2,"id":3719,"poster_path":"\/uu31OmiUqXO3eN1TH4Idy78ah82.jpg"},{"air_date":"2006-09-21","overview":"The third season of the American television medical drama Grey's Anatomy, commenced airing on the American Broadcasting Company on September 21, 2006, and concluded on May 17, 2007. The season was produced by Touchstone Television, in association with Shondaland Production Company and The Mark Gordon Company, the showrunner being Shonda Rhimes. Actors Ellen Pompeo, Sandra Oh, Katherine Heigl, Justin Chambers, and T.R. Knight reprised their roles as surgical interns Meredith Grey, Cristina Yang, Izzie Stevens, Alex Karev, and George O'Malley, respectively, continuing their expansive storylines as focal points throughout the season. Previous main cast members Chandra Wilson, James Pickens, Jr., Kate Walsh, Isaiah Washington, and Patrick Dempsey also returned, while previous guest stars Sara Ramirez and Eric Dane were promoted to series regulars, following the extension of their contracts.\n\nThe season followed the continuation of the surgical residency of five young interns, as they experience the demands of the competitive field of medicine, which becomes defining in their personal evolution. Although set in fictional Seattle Grace Hospital, located in Seattle, Washington, filming primarily occurred in Los Angeles, California. Whereas the first season mainly focused on the impact the surgical field has on the main characters, and the second one provided a detailed perspective on the physicians' private lives, the third season deals with the tough challenges brought by the last phase of the surgeons' internship, combining the professional motif emphasized in the first season, with the complex personal background used in the second. Through the season, several new storylines are introduced, including the arrival of Dane's character, Dr. Mark Sloan, conceived and introduced as an antagonizing presence.","episode_count":25,"name":"Season 3","season_number":3,"id":3715,"poster_path":"\/q05y5UvI6SR4qImBe3C7HybxBhe.jpg"},{"air_date":"2007-09-27","overview":"The fourth season of the American television medical drama Grey's Anatomy, commenced airing in the United States on September 27, 2007 and concluded on May 22, 2008. The season continues the story of a group of surgeons and their mentors in the fictional Seattle Grace Hospital, describing their professional lives and the way they affect the personal background of each character. Season four had twelve series regulars with ten of them returning from the previous season, out of which eight are part of the original cast from the first season. The season aired in the Thursday night timeslot at 9:00 EST. In addition to the regular seventeen episodes, a clip-show narrated by the editors of People recapped previous events of the show and made the transition from Grey's Anatomy to Private Practice, a spin-off focusing of Dr. Addison Montgomery and aired on September 19, 2007, before the season premiere. The season was officially released on DVD as a five-disc boxset under the title of Grey's Anatomy: Season Four – Expanded on September 9, 2008 by Buena Vista Home Entertainment.\n\nFor the first time in the show's history, many cast changes occur, seeing the first departure of two main cast members. The season received mixed response from critics and fans, resulting in several awards and nominations for the cast members and the production team. Show creator Shonda Rhimes heavily contributed to the production of the season, writing five out of the seventeen episodes. The highest-rated episode was the season premiere, which was watched by 20.93 million viewers. The season was interrupted by the 2007–2008 Writers Guild of America strike, which resulted in the production of only seventeen episodes, instead of twenty-three originally planned.","episode_count":17,"name":"Season 4","season_number":4,"id":3716,"poster_path":"\/aqZdPsgEV7rbD3jxBVMGB2yLyxK.jpg"},{"air_date":"2008-09-25","overview":"The fifth season of the American television medical drama Grey's Anatomy, created by Shonda Rhimes, commenced airing on American Broadcasting Company in the United States on September 25, 2008 and concluded on May 14, 2009 with twenty-four aired episodes. The season follows the story of a group of surgeons as they go through their residency, while they also deal with the personal challenges and relationships with their mentors. Season five had thirteen series regulars with twelve of them returning from the previous season. The season aired in the Thursday night timeslot at 9:00 pm. The season was officially released on DVD as seven-disc boxset under the title of Grey's Anatomy: The Complete Fifth Season – More Moments on September 9, 2009 by Buena Vista Home Entertainment.","episode_count":24,"name":"Season 5","season_number":5,"id":3717,"poster_path":"\/u7fXiIuJeQcLNq946XHyJD2qQ3a.jpg"},{"air_date":"2009-09-24","overview":"The sixth season of the American television medical drama Grey's Anatomy, commenced airing on the American Broadcasting Company in the United States on September 24, 2009, and concluded on May 20, 2010. The season was produced by ABC Studios, in association with Shondaland Production Company and The Mark Gordon Company; the showrunner being Shonda Rhimes. Actors Ellen Pompeo, Sandra Oh, Katherine Heigl, and Justin Chambers reprised their roles as surgical residents Meredith Grey, Cristina Yang, Izzie Stevens, and Alex Karev, respectively. Heigl was released from her contract in the middle of the season, while T.R. Knight did not appear as George O'Malley, because Knight was released from his contract at the conclusion of season five. Main cast members Patrick Dempsey, Chandra Wilson, James Pickens, Jr., Sara Ramirez, Eric Dane, Chyler Leigh, and Kevin McKidd also returned, while previous recurring star Jessica Capshaw was promoted to a series regular, and Kim Raver was given star billing after the commencement of the season.\n\nThe season follows the story of surgical interns, residents and their competent mentors, as they experience the difficulties of the competitive careers they have chosen. It is set in the surgical wing of the fictional Seattle Grace Hospital, located in Seattle, Washington. A major storyline of the season is the characters adapting to change, as their beloved co-worker Stevens departed following the breakdown of her marriage, O'Malley died in the season premiere—following his being dragged by a bus, and new cardiothoracic surgeon Teddy Altman is given employment at the hospital. Further storylines include Shepherd being promoted to chief of surgery, Seattle Grace Hospital merging with the neighboring Mercy West —introducing several new doctors, and several physicians lives being placed into danger—when a grieving deceased patient's husband embarks on a shooting spree at the hospital, seeking revenge for his wife's death.","episode_count":24,"name":"Season 6","season_number":6,"id":3720,"poster_path":"\/vCiJa2YfzOWhhfKCXNZWFVhYulE.jpg"},{"air_date":"2010-09-23","overview":"The seventh season of the American television medical drama Grey's Anatomy, commenced airing on September 23, 2010 on the American Broadcasting Company, and concluded on May 19, 2011 ending the season with a total of 22 episodes. The season was produced by ABC Studios, in association with Shondaland Production Company and The Mark Gordon Company; the showrunner being Shonda Rhimes.","episode_count":22,"name":"Season 7","season_number":7,"id":3721,"poster_path":"\/wmGUedMQJkmSZFYJA35AKPrHsGJ.jpg"},{"air_date":"2011-09-22","overview":"The eighth season of the American television medical drama Grey's Anatomy, commenced airing on the American Broadcasting Company on September 22, 2011, with a special two-hour episode and ended on May 17, 2012 with the eighth season having a total of 24 episodes. The season was produced by ABC Studios, in association with Shondaland Production Company and The Mark Gordon Company; the showrunner being Shonda Rhimes.","episode_count":24,"name":"Season 8","season_number":8,"id":3723,"poster_path":"\/tKALCtTpWUJPkQ3GCWpHpErASDR.jpg"},{"air_date":"2012-09-27","overview":"The ninth season of the American television medical drama Grey's Anatomy began airing in the United States on the American Broadcasting Company on September 27, 2012, and consists of 24 episodes.\n\nIt was announced by ABC on May 10, 2013 that the tenth season of Grey's Anatomy would begin in the Fall of 2013.","episode_count":24,"name":"Season 9","season_number":9,"id":3724,"poster_path":"\/bVuyTPusfoNuhyavNaADSTGpVy8.jpg"},{"air_date":"2013-09-26","overview":"The tenth season of the American television medical drama Grey's Anatomy began airing in the United States on the American Broadcasting Company on September 26, 2013, and will consist of 24 episodes.","episode_count":24,"name":"Season 10","season_number":10,"id":3725,"poster_path":"\/h0z0USK1KerDJu02c218zFMIa52.jpg"},{"air_date":"2014-09-25","overview":"During an interview, Shonda Rhimes stated that \"Season 11 is really a Meredith-centric season. She lost her ‘person’, her half-sister has shown up, her husband is chafing to go someplace else…” She went on to reveal that she's been wanting to do the \"familial grenade\" storyline for a long time, and at the end of Season 10, she knew it was the time to do it. Rhimes also claimed that Season 11 will pick up right where Season 10 left us, so there won't be much that the audience won't see. In another interview discussing this storyline, Rhimes revealed that she and the writers are thinking about doing flashback periods to the younger days of Drs. Ellis Grey and Richard Webber.","episode_count":24,"name":"Season 11","season_number":11,"id":62051,"poster_path":"\/AvMxKxyj6zIG5fR0fg7D6bWH4AY.jpg"},{"air_date":"2015-09-24","overview":"","episode_count":24,"name":"Season 12","season_number":12,"id":70494,"poster_path":"\/b8pkzoNM5X0XSwppEA7jTID5Dcm.jpg"},{"air_date":"2016-09-22","overview":"","episode_count":24,"name":"Season 13","season_number":13,"id":79174,"poster_path":"\/i4gNHaY1MzP50zcjgw3ew2hKCCW.jpg"},{"air_date":"2017-09-27","overview":"","episode_count":24,"name":"Season 14","season_number":14,"id":92088,"poster_path":"\/2eSQFbeZZ7lCru40Q0UYGJ20itx.jpg"},{"air_date":"2018-09-27","overview":"","episode_count":6,"name":"Season 15","season_number":15,"id":108798,"poster_path":"\/qKAXgqiNTLwfS7Gz01jmvZHEtIa.jpg"},{"air_date":null,"overview":"","episode_count":0,"name":"Season 21","season_number":21,"id":111263,"poster_path":null}],"rating":6.3,"serieType":[18],"id":1416,"title":"Grey's Anatomy"},{"summary":"The Big Bang Theory is centered on five characters living in Pasadena, California: roommates Leonard Hofstadter and Sheldon Cooper; Penny, a waitress and aspiring actress who lives across the hall; and Leonard and Sheldon's equally geeky and socially awkward friends and co-workers, mechanical engineer Howard Wolowitz and astrophysicist Raj Koothrappali. The geekiness and intellect of the four guys is contrasted for comic effect with Penny's social skills and common sense.","date":"2007-09-24","imageLink":"\/ooBGRQBdbGzBxAVfExiO8r7kloA.jpg","seasons":[{"air_date":null,"overview":"","episode_count":3,"name":"Specials","season_number":0,"id":3732,"poster_path":"\/gtWHKUsG8de6LdZQoCsjUqrLJ1R.jpg"},{"air_date":"2007-09-24","overview":"University physicists Leonard and Sheldon know whether to use an integral or a differential to solve the area under a curve. But they don't have a clue about girls. Or dating. Or clothes. Or parties. Or having fun. Or, basically, life. So when a pretty blonde named Penny moves in the apartment across the hall, the guys decide to get an education outside of the classroom. Boys, you have a lot to learn.","episode_count":17,"name":"Season 1","season_number":1,"id":3738,"poster_path":"\/zqAL2rav7Tg8uwDtLurqZVN3mtr.jpg"},{"air_date":"2008-09-22","overview":"This season, Leonard gets a girl. So does Sheldon. Howard drives the Mars Rover into a ditch. Raj woos a terminator. Gorgeous girl-next-door Penny falls under the spell of Age of Conan. And super-smart, ueberconfident Leslie Winkler reduces mere men to spineless jellyfish.","episode_count":23,"name":"Season 2","season_number":2,"id":3733,"poster_path":"\/2NBwUBZ4clwj6qO9fBinfxiB0dR.jpg"},{"air_date":"2009-09-21","overview":"Worlds collide in Season 3! A love affair with Penny has opened a big, wide, wonderful world of romance for Leonard. But Sheldon likes the world just the way it was, thank you. All of which makes for a zany comic triangle with brainy, clueless Sheldon and practical, grounded Penny hilariously vying for the role of hypotenuse.","episode_count":23,"name":"Season 3","season_number":3,"id":3734,"poster_path":"\/j64iUb52W2IYE9qV9pLi5tFq8IE.jpg"},{"air_date":"2010-09-23","overview":"This season the Big Bang gang’s romantic universe expands. On the rebound from Penny, Leonard falls into the arms of Raj’s sister Priya. Sheldon gets a girlfriend, or rather a friend who is a girl: Amy, a dour neurobiologist who declares herself besties with Penny. Howard and Bernadette heat up. And so do Raj and Bernadette (at least in Raj’s Bollywood daydream).","episode_count":24,"name":"Season 4","season_number":4,"id":3735,"poster_path":"\/hM2TYCmOVXop1xhLA1Mbqyg60ze.jpg"},{"air_date":"2011-09-22","overview":"In season five, Penny and Leonard's relationship is relaunched in full \"beta test\" mode, while Sheldon, Howard, and Raj discover the feminine mystique is something that cannot be easily graphed or calculated. As Sheldon makes begrudging amendments to his \"Relationship Agreement\" with his \"friend-who-happens-to-be-a-girl\" Amy Farrah Fowler, Raj contemplates an arranged marriage, and Howard is all-systems-go for both is NASA space launch and wedding to the spirited Bernadette.","episode_count":24,"name":"Season 5","season_number":5,"id":3736,"poster_path":"\/l08Z8ihAsTRPEuOehbwk4axg3cu.jpg"},{"air_date":"2012-09-27","overview":"Whether on or above Earth, hilarity is outrageously universal in TV's most popular comedy featuring four forward-thinking but socially backward geniuses. Fun discoveries multiply: Leonard learns jealousy is bad for a relationship (with Penny) but science is good for seduction (of Penny). Howard finds life in the International Space Station life is no escape from terrestrial turmoil between his mom and his new wife Bernadette. Raj meets someone special who may be a good match, if he can keep her from fleeing mid-date. And then there's Sheldon. He learns what not to say after facing harassment charges or competing for tenure at work and how Dungeons & Dragons can be the icebreaker his relationship with Amy needs.","episode_count":24,"name":"Season 6","season_number":6,"id":3737,"poster_path":"\/2Rsb94mlt4OHhiO2UWatDOhnBqv.jpg"},{"air_date":"2013-09-25","overview":"Leonard returns from his North Sea expedition to find that his relationship with Penny involves more beta-testing than he’s ever done in a lab. Howard’s attachment issues with the women in his life in particular and Raj’s social breakthrough with women in general provide more laughs. Bernadette and Amy stand staunchly by the men in their life, even when they’re sitting in marathon role-playing games. Sheldon sees his mom in a totally different way, parties with James Earl Jones, establishes a (sort of) bond with his idol Professor Proton and makes a scientific breakthrough that breaks down before you can say Science Friday.","episode_count":24,"name":"Season 7","season_number":7,"id":3739,"poster_path":"\/j1FU0qKHx1F8FVBmK5DBOTrhsAr.jpg"},{"air_date":"2014-09-22","overview":"Sheldon is rescued from his soul-searching cross-country train trip (older but no wiser) and that means The Big Bang Theory gang's all here to spread another gear's cheer as TV's most attended laugh seminar. Enrol in the comic curriculum to observe Leonard's minor surgery, which signals a major catastrophe for Sheldon, Howard's obsession over his mum's relationship with friend-turned-freeloader Stuart and the unexpected results of Penny's technique as a pharmaceutical sales rep. Discover ways to re-create proms not attended or holiday celebrations not especially beloved and play a new game based on Raj's dating life. Savour online fan Fiction by Amy, watch Bernadette take indelicate command of some delicate family matters and, who knows, you might spot a cool special guest or two.","episode_count":24,"name":"Season 8","season_number":8,"id":62016,"poster_path":"\/71669CxKEeyqtItFH6mFHKxPh3y.jpg"},{"air_date":"2015-09-21","overview":"Our two genius roommates, Leonard and Sheldon, and their friends are back once again (smarter, but no wiser). Last season, Sheldon went soul-searching (on a train, of course) and was prepared to make some substantial revisions on his Relationship Agreement with Amy, when everything changed. Leonard, meanwhile, was off to Vegas with Penny to finally tie the knot in the season finale. Howard finds himself alone with Bernadette after the sudden passing of his mother; while Raj is not only talking to women – he’s getting exclusive with Emily. Together, they will all learn that life is far more complicated outside of the lab as love and friendship never produce predictable results!","episode_count":24,"name":"Season 9","season_number":9,"id":70493,"poster_path":"\/eKDvR1vYLCE08K1h0KUfHNliD8T.jpg"},{"air_date":"2016-09-19","overview":"Leonard and Penny renew their vows, this time inviting their friends and family for wedding party; they also learn that marriage is about compromise, and figure out how to support each other. Sheldon and Amy experiment to take their relationship to the next level, and after an emotional struggle they move in together in Penny's old apartment. Howard and Bernadette realise that being a parent is a full-time job, but with the help of their friends they manage to find joy in raising their child. When his friends tell him he's extremely spoiled, Raj decides to stop taking his father's money and learn how to make ends meet.","episode_count":24,"name":"Season 10","season_number":10,"id":80035,"poster_path":"\/dz2Mq1bpjBFiTOJbomCEP59kqJV.jpg"},{"air_date":"2017-09-25","overview":"After years of only looking out for himself, Sheldon found Amy Farrah Fowler to be the most patient woman to ever walk the earth, and... they did it! Wedding fever continues on The Big Bang Theory. Sheldon and Amy did indeed tie the knot, but only after the bride helped her groom discover the scientific concept of \"super asymmetry\" by pointing out that Sheldon's bowtie was perfectly proportioned. Such a ShAmy wedding...","episode_count":24,"name":"Season 11","season_number":11,"id":91000,"poster_path":"\/A373F7AzZtIFy3l2LryC2yr2hC2.jpg"},{"air_date":"2018-09-24","overview":"","episode_count":6,"name":"Season 12","season_number":12,"id":107083,"poster_path":"\/wsbrXP0qAKwrJ3ZUCoLwFI4Qws3.jpg"}],"rating":6.8,"serieType":[35],"id":1418,"title":"The Big Bang Theory"},{"summary":"Danny Rand resurfaces 15 years after being presumed dead. Now, with the power of the Iron Fist, he seeks to reclaim his past and fulfill his destiny.","date":"2017-03-17","imageLink":"\/nv4nLXbDhcISPP8C1mgaxKU50KO.jpg","seasons":[{"air_date":"2017-03-17","overview":"Fifteen years after being presumed dead in a plane crash, Danny Rand mysteriously returns to New York City determined to reclaim his birthright and family company. However, when a long-destined enemy rises in New York, this living weapon is forced to choose between his family’s legacy and his duties as the Iron Fist.","episode_count":13,"name":"Season 1","season_number":1,"id":65211,"poster_path":"\/usGfoL4RfX15f1sQcX3Sgw4YRf4.jpg"},{"air_date":"2018-09-07","overview":"Season 2 furthers the transformation of Danny​, a character with a fish out of water coming of age story making his way in a harsh new world, battling to work out who he is. This season, Dann​y​ has promised that with Matt Murdock gone, he will step up and protect his city. ​But a sinister plot twist threatens his very identity ​and he must conquer his villains to protect the town and people he holds close to his heart.","episode_count":10,"name":"Season 2","season_number":2,"id":106628,"poster_path":"\/vXYvfCWvz5W0rErCpNIq09urhzW.jpg"}],"rating":6.1,"serieType":[80,18,10759,10765],"id":62127,"title":"Marvel's Iron Fist"},{"summary":"Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.","date":"1989-12-17","imageLink":"\/yTZQkSsxUFJZJe67IenRM0AEklc.jpg","seasons":[{"air_date":"1987-04-19","overview":"","episode_count":61,"name":"Specials","season_number":0,"id":3581,"poster_path":"\/lzN0CllVFXtGtSl15r59Kb52DdT.jpg"},{"air_date":"1989-12-17","overview":"The Simpsons' first season originally aired between December 17, 1989 and May 13, 1990, beginning with the Christmas special \"Simpsons Roasting on an Open Fire\". The executive producers for the first production season were Matt Groening, James L. Brooks, and Sam Simon.\n\nThe series was originally set to debut in late 1989 with the episode \"Some Enchanted Evening\", which was meant to introduce the main characters; during the first screening of the episode, the producers discovered that the animation was so appalling that 70% of the episode needed to be redone. The producers considered aborting the series if the next episode turned out as bad, but it only suffered from easily fixable problems. The producers convinced Fox to move the debut to December 17, and aired \"Simpsons Roasting on an Open Fire\" as the first episode of the series. The first season won one Emmy Award, and received four additional nominations.\n\nThe DVD boxset was released on September 25, 2001 in Region 1 and September 24, 2001 in both Region 2 and Region 4. Season one was also released for the iTunes Store on December 22, 2010, dubbed a \"digital edition.\"","episode_count":13,"name":"Season 1","season_number":1,"id":3582,"poster_path":"\/o6wvnWuUKW1g2bLs2gmI2ObMYJG.jpg"},{"air_date":"1991-03-23","overview":"The Simpsons' second season originally aired between October 11, 1990 and May 9, 1991, and contained 22 episodes, beginning with \"Bart Gets an F\". Another episode, \"Blood Feud\" aired during the summer after the official season finale. The executive producers for the second production season were Matt Groening, James L. Brooks, and Sam Simon, who had also been EPs for the previous season. The DVD box set was released on August 6, 2002 in Region 1, July 8, 2002 in Region 2 and in September, 2002 in Region 4. The episode \"Homer vs. Lisa and the 8th Commandment\" won the Primetime Emmy Award for Outstanding Animated Program, and was also nominated in the \"Outstanding Sound Mixing for a Comedy Series or a Special\" category.","episode_count":22,"name":"Season 2","season_number":2,"id":3583,"poster_path":"\/yW7Q9Zh2QQjI079cwdqwBMidyiF.jpg"},{"air_date":"1991-09-19","overview":"The Simpsons' third season originally aired on the Fox network between September 19, 1991 and May 7, 1992. The showrunners for the third production season were Al Jean and Mike Reiss who executive produced 22 episodes for the season, while two other episodes were produced by James L. Brooks, Matt Groening, and Sam Simon. An additional episode, \"Brother, Can You Spare Two Dimes?\", aired on August 27, 1992 after the official end of the third season and is included on the Season 3 DVD set. Season three won six Primetime Emmy Awards for \"Outstanding Voice-Over Performance\" and also received a nomination for \"Outstanding Animated Program\" for the episode \"Radio Bart\". The complete season was released on DVD in Region 1 on August 26, 2003, Region 2 on October 6, 2003, and in Region 4 on October 22, 2003.","episode_count":24,"name":"Season 3","season_number":3,"id":3584,"poster_path":"\/PQKmDO7aUftceeyDh06to2mEq7.jpg"},{"air_date":"1992-09-24","overview":"The Simpsons' fourth season originally aired on the Fox network between September 24, 1992 and May 13, 1993, beginning with \"Kamp Krusty.\" The showrunners for the fourth production season were Al Jean and Mike Reiss. The aired season contained two episodes which were hold-over episodes from season three, which Jean and Reiss also ran. Following the end of the production of the season, Jean, Reiss and most of the original writing staff left the show. The season was nominated for two Primetime Emmy Awards and Dan Castellaneta would win one for his performance as Homer in \"Mr. Plow\". The fourth season was released on DVD in Region 1 on June 15, 2004, Region 2 on August 2, 2004 and in Region 4 on August 25, 2004.","episode_count":22,"name":"Season 4","season_number":4,"id":3585,"poster_path":"\/5B8plT0VgmQW1sOYgaMgWXrFz2a.jpg"},{"air_date":"1993-09-30","overview":"The Simpsons' fifth season originally aired on the Fox network between September 30, 1993 and May 19, 1994. The showrunner for the fifth production season was David Mirkin who executive produced 20 episodes. Al Jean and Mike Reiss executive produced the remaining two, which were both hold overs that were produced for the previous season. The season contains some of the series' most acclaimed episodes, including \"Cape Feare\" and \"Rosebud\". It also includes the 100th episode, \"Sweet Seymour Skinner's Baadasssss Song\". The season was nominated for two Primetime Emmy Awards and won an Annie Award for Best Animated Television Program as well as an Environmental Media Award and a Genesis Award. The DVD box set was released in Region 1 on December 21, 2004, Region 2 on March 21, 2005, and Region 4 on March 23, 2005.","episode_count":22,"name":"Season 5","season_number":5,"id":3586,"poster_path":"\/5byFzVVUX1APYC1a93KMNrQIAho.jpg"},{"air_date":"1994-09-04","overview":"The Simpsons' sixth season originally aired on the Fox network between September 4, 1994, and May 21, 1995, and consists of 25 episodes. The Simpsons is an animated series about a working class family, which consists of Homer, Marge, Bart, Lisa, and Maggie. The show is set in the fictional city of Springfield, and lampoons American culture, society, television and many aspects of the human condition.\n\nThe showrunner for the sixth production season was David Mirkin who executive-produced 23 episodes. Former showrunners Al Jean and Mike Reiss produced the remaining two; they produced the two episodes with the staff of The Critic, the show they left The Simpsons to create. This was done in order to relieve some of the stress The Simpsons' writing staff endured, as they felt that producing 25 in one season was too much. The episode \"A Star Is Burns\" caused some controversy among the staff with Matt Groening removing his name from the episode's credits as he saw it as blatant advertising for The Critic, which was airing at the time. Fox moved The Simpsons back to its original Sunday night time, having aired on Thursdays for the previous four seasons. It has remained in this slot ever since. The sixth season won one Primetime Emmy Award, and received three additional nominations. It also won the Annie Award for Best Animated Television Production.","episode_count":25,"name":"Season 6","season_number":6,"id":3587,"poster_path":"\/2gnDoTCgBwLqgJ1JHw8Ssxlfs5y.jpg"},{"air_date":"1995-09-17","overview":"The Simpsons' seventh season originally aired on the Fox network between September 17, 1995 and May 19, 1996. The show runners for the seventh production season were Bill Oakley and Josh Weinstein who would executive produce 21 episodes this season. David Mirkin executive produced the remaining four, including two hold overs that were produced for the previous season. The season was nominated for two Primetime Emmy Awards, including Outstanding Animated Program and won an Annie Award for Best Animated Television Program. The DVD box set was released in Region 1 December 13, 2005, Region 2 January 30, 2006 and Region 4 on March 22, 2006. The set was released in two different forms: a Marge-shaped box and also a standard rectangular-shaped box in which the theme is a movie premiere.","episode_count":25,"name":"Season 7","season_number":7,"id":3588,"poster_path":"\/xYGX2iSj7zPu74Pc2skbK93LPB3.jpg"},{"air_date":"1996-10-27","overview":"The Simpsons' eighth season originally aired between October 27, 1996 and May 18, 1997, beginning with \"Treehouse of Horror VII\". The showrunners for the eighth production season were Bill Oakley and Josh Weinstein. The aired season contained two episodes which were hold-over episodes from season seven, which Oakley and Weinstein also ran. It also contained two episodes for which Al Jean and Mike Reiss were the show runners.\n\nSeason eight won multiple awards, including two Emmy Awards: \"Homer's Phobia\" won for Outstanding Animated Program in 1997, and Alf Clausen and Ken Keeler won for \"Outstanding Individual Achievement in Music and Lyrics\" with the song \"We Put The Spring In Springfield\" from the episode \"Bart After Dark\". Clausen also received an Emmy nomination for \"Outstanding Music Direction\" for \"Simpsoncalifragilisticexpialacious\". \"Brother from Another Series\" was nominated for the Emmy for \"Sound Mixing For a Comedy Series or a Special\". For \"Homer's Phobia\", Mike Anderson won the Annie Award for Best Individual Achievement: Directing in a TV Production, and the WAC Winner Best Director for Primetime Series at the 1998 World Animation Celebration. Gay & Lesbian Alliance Against Defamation awarded the episode the GLAAD Media Award for \"Outstanding TV – Individual Episode\".","episode_count":25,"name":"Season 8","season_number":8,"id":3589,"poster_path":"\/e3ZzhSKyBCKf3P09yu9cfHCFjGr.jpg"},{"air_date":"1997-09-21","overview":"The Simpsons' ninth season originally aired between September 1997 and May 1998, beginning on Sunday, September 21, 1997 with \"The City of New York vs. Homer Simpson\". The showrunner for the ninth production season was Mike Scully. The aired season contained three episodes which were hold-over episodes from season eight, which Bill Oakley and Josh Weinstein ran. It also contained two episodes which were run by David Mirkin, and another two hold-over episodes from season seven which were run by Al Jean and Mike Reiss.\n\nSeason nine won three Emmy Awards: \"Trash of the Titans\" for Primetime Emmy Award for Outstanding Animated Program in 1998, Hank Azaria picked up \"Outstanding Voice-Over Performance\" for the voice of Apu Nahasapeemapetilon, and Alf Clausen and Ken Keeler picking up the \"Outstanding Music and Lyrics\" award. Clausen was also nominated for \"Outstanding Music Direction\" and \"Outstanding Music Composition for a Series\" for \"Treehouse of Horror VIII\". Season nine was also nominated for a \"Best Network Television Series\" award by the Saturn Awards and \"Best Sound Editing\" for a Golden Reel Award.","episode_count":25,"name":"Season 9","season_number":9,"id":3590,"poster_path":"\/bETUFDott6p55CFNYs8FNxYQEkT.jpg"},{"air_date":"1998-08-23","overview":"The tenth season of the animated television series The Simpsons was originally broadcast on the Fox network in the United States between August 23, 1998 and May 16, 1999. It contains twenty-three episodes, starting with \"Lard of the Dance\". The Simpsons is a satire of a middle class American lifestyle epitomized by its family of the same name, which consists of Homer, Marge, Bart, Lisa and Maggie. Set in the fictional city of Springfield, the show lampoons American culture, society, television, and many aspects of the human condition.\n\nThe showrunner for the tenth season was Mike Scully. Before production began, a salary dispute between the main cast members of The Simpsons and Fox arose. However, it was soon settled and the actors' salaries were raised to $125,000 per episode. In addition to the large Simpsons cast, many guest stars appeared in season ten, including Phil Hartman in his last appearance before his death.\n\nThe season, which won the Annie Award for \"Outstanding Achievement in an Animated Television Program\", has been cited by several critics as the beginning of the series' decline in quality. It ranked twenty-fifth in the season ratings with an average of 13.5 million viewers per episode. The tenth season DVD boxset was released in the United States and Canada on August 7, 2007. It is available in two different packagings, both featuring Bart.","episode_count":23,"name":"Season 10","season_number":10,"id":3591,"poster_path":"\/oXFElouedRJkMu6v9KNQt6cHjXJ.jpg"},{"air_date":"1999-09-26","overview":"The Simpsons' 11th season originally aired between September 1999 and May 2000, beginning on Sunday, September 26, 1999, with \"Beyond Blunderdome\". The showrunner for the 11th production season was Mike Scully. The season contained four hold-over episodes from the season 10 production line.","episode_count":22,"name":"Season 11","season_number":11,"id":3592,"poster_path":"\/zYzsOO6LaqmDcFrHc73A9btOc8N.jpg"},{"air_date":"2000-11-01","overview":"The Simpsons' 12th season began on Wednesday, November 1, 2000 with \"Treehouse of Horror XI\". The season contains three hold over episodes from the season 11 production line. The show runner for the twelfth production was Mike Scully. The season features three episodes that were produced for the eleventh season which was also run by Scully. The season won and was nominated for numerous awards including two Primetime Emmy Awards wins and an Annie Award.","episode_count":21,"name":"Season 12","season_number":12,"id":3593,"poster_path":"\/2Cy4b4jiKVD45yrwb8GWdC2bE0H.jpg"},{"air_date":"2001-11-06","overview":"The Simpsons' thirteenth season originally aired on the Fox network between November 6, 2001 and May 22, 2002 and consists of 22 episodes. The show runner for the thirteenth production season was Al Jean who executive-produced 17 episodes. Mike Scully executive-produced the remaining five, which were all hold-overs that were produced for the previous season. The Simpsons is an animated series about a working-class family, which consists of Homer, Marge, Bart, Lisa, and Maggie. The show is set in the fictional city of Springfield, and lampoons American culture, society, television and many aspects of the human condition.\n\nThe season won an Annie Award for Best Animated Television Production, and was nominated for several other awards, including two Primetime Emmy Awards, three Writers Guild of America Awards, and an Environmental Media Award. The Simpsons ranked 30th in the season ratings with an average viewership of 12.4 million viewers. It was the second highest rated show on Fox after Malcolm in the Middle. The DVD boxset was released in the United States and Canada on August 24, 2010, eight years after it had completed broadcast on television.","episode_count":22,"name":"Season 13","season_number":13,"id":3594,"poster_path":"\/cn7aESAxPA3o1OLJbrM7T0ETYIE.jpg"},{"air_date":"2002-11-03","overview":"The fourteenth season of the animated television series The Simpsons was originally broadcast on the Fox network in the United States between November 3, 2002 and May 18, 2003. The show runner for the fourteenth production season was Al Jean, who executive produced 21 of 22 episodes. The other episode, \"How I Spent My Strummer Vacation\", was run by Mike Scully. The season contains five hold-overs from the previous season's production run. The fourteenth season won two Primetime Emmy Awards, including Outstanding Animated Program, four Annie Awards and a Writers Guild of America Award. On December 6, 2011, it was released on DVD and Blu-ray in North America.","episode_count":22,"name":"Season 14","season_number":14,"id":3595,"poster_path":"\/nwZc3mBBCGPRqIUSGGL29sTzutx.jpg"},{"air_date":"2003-11-02","overview":"The Simpsons' 15th season began on Sunday, November 2, 2003, with \"Treehouse of Horror XIV\". The season contains five hold-over episodes from the season 14 production line. The most watched episode had 16.2 million viewers and the least watched had 6.2 million viewers.","episode_count":22,"name":"Season 15","season_number":15,"id":3596,"poster_path":"\/dZiUfyxBAs8NizSjaJa8VeFNizj.jpg"},{"air_date":"2004-11-07","overview":"The Simpsons' 16th season began on Sunday, November 7, 2004 and contained 21 episodes, beginning with Treehouse of Horror XV. The season contains six hold-over episodes from the season 15 production line.","episode_count":21,"name":"Season 16","season_number":16,"id":3597,"poster_path":"\/dpETtKG5fGAJJZYgPD0m3kQ99WQ.jpg"},{"air_date":"2005-09-11","overview":"The Simpsons' seventeenth season originally aired between September 2005 and May 2006, beginning on Sunday, September 11, 2005. It broke Fox's tradition of pushing its shows' season premieres back to November to accommodate the Major League Baseball games airing on the network during September and October of each year.","episode_count":22,"name":"Season 17","season_number":17,"id":3598,"poster_path":"\/qRNdd8RC6gfFfpw9nLteLkxfgmb.jpg"},{"air_date":"2006-09-10","overview":"The Simpsons' 18th season aired from September 10, 2006 to May 20, 2007. The season contained seven hold-over episodes from the season 17 production line. Al Jean served as the Showrunner, a position he has held since the thirteenth season.\n\nThe season finale, \"You Kent Always Say What You Want\", was the series' 400th episode. Additionally, the Simpsons franchise celebrated its 20th anniversary, as it has been on the air since April 1987, beginning with shorts on The Tracey Ullman Show.\n\nSeason 18 included guest appearances by Metallica, Tom Wolfe, Gore Vidal, Michael Chabon, Jonathan Franzen, Fran Drescher, The White Stripes, Kiefer Sutherland, Mary Lynn Rajskub, Richard Lewis, Phil McGraw, Elvis Stojko, Natalie Portman, Jon Lovitz, Betty White, Eric Idle, Sir Mix-a-Lot, Stephen Sondheim, Cristiano Ronaldo, Meg Ryan, Andy Dick, Peter Bogdanovich, James Patterson and others.","episode_count":22,"name":"Season 18","season_number":18,"id":3599,"poster_path":"\/6k5SqqGhhfsuld8jLFry6enNsn6.jpg"},{"air_date":"2007-09-23","overview":"The Simpsons' nineteenth season originally aired on the Fox network between September 23, 2007 and May 18, 2008.","episode_count":20,"name":"Season 19","season_number":19,"id":3600,"poster_path":"\/k6b0SGBNXYPGu8aCz9tiVdn1J7P.jpg"},{"air_date":"2008-09-28","overview":"The Simpsons' twentieth season aired on Fox from September 28, 2008 to May 17, 2009. With this season, the show tied Gunsmoke as the longest running American primetime television series in terms of total number of seasons. The season was released on BD January 12, 2010, making this the first season released on BD. It was released on DVD in Region 1 on January 12, 2010, and in Region 4 on January 20, 2010. The season was only released on DVD in Region 2 in a few areas.","episode_count":21,"name":"Season 20","season_number":20,"id":3601,"poster_path":"\/tuFcMqjkyRPgWvzelR0odQHvuWt.jpg"},{"air_date":"2009-09-27","overview":"The Simpsons' twenty-first season aired on Fox from September 27, 2009 to May 23, 2010. It was the first of two seasons that the show was renewed for by Fox, and also the first season of the show to air entirely in high definition.\n\nWith this season, The Simpsons established itself as the longest-running American primetime television series surpassing Gunsmoke.\n\nThe season received mainly positive reviews from critics, with many praising \"The Squirt and the Whale\", \"To Surveil with Love\" and \"The Bob Next Door\". The show moved up 16 positions in the Nielsen ratings from the previous season and received numerous award nominations, winning two - an Emmy Award for Anne Hathaway for her voicing in \"Once Upon a Time in Springfield\", and an Annie Award for \"Treehouse of Horror XX\".","episode_count":23,"name":"Season 21","season_number":21,"id":3602,"poster_path":"\/yZ1v1DyqFJWrMxjo12ssNPRy6si.jpg"},{"air_date":"2010-09-26","overview":"The Simpsons' twenty-second season began airing on Fox on September 26, 2010 and ended on May 22, 2011. The Simpsons was renewed for at least two additional seasons during the twentieth season leading up to this season. The cast is currently signed through the 25th season. On November 11, 2010, the series was renewed for a 23rd season by Fox with 22 episodes.","episode_count":22,"name":"Season 22","season_number":22,"id":3603,"poster_path":"\/lbpIPMv2Ec8BODAkT5lPxQlMH2W.jpg"},{"air_date":"2011-09-25","overview":"The Simpsons' twenty-third season began airing on Fox on September 25, 2011 and ended on May 20, 2012. The show's 500th episode, \"At Long Last Leave\", aired on February 19, 2012.","episode_count":22,"name":"Season 23","season_number":23,"id":3604,"poster_path":"\/cCxOCBZAkDwEbP6ErKgqCKGEoWX.jpg"},{"air_date":"2012-09-30","overview":"The Simpsons' twenty-fourth season began airing on Fox on September 30, 2012 and concluded on May 19, 2013.","episode_count":22,"name":"Season 24","season_number":24,"id":3605,"poster_path":"\/geQfditNq4d4pZXAEAnUAFtWoGL.jpg"},{"air_date":"2013-09-29","overview":"The Simpsons' twenty-fifth season began airing on Fox on September 29, 2013.\n\nIn this season, Homer sells his Mapple stock to buy a bowling ball, Marge blames herself and KISS for Bart's rebellious streak, Lisa becomes a cheerleader for Springfield's football team, and Homer delivers a baby. Guest stars for this season will include Christiane Amanpour, Will Arnett, Stan Lee, Rachel Maddow, Elisabeth Moss, Joe Namath, Gordon Ramsay, Aaron Sorkin, Eva Longoria, Daniel Radcliffe, Kristen Wiig, Billy West, Katey Sagal, John DiMaggio, Phil LaMarr, Zach Galifianakis, Harlan Ellison, Anderson Cooper, Maurice LaMarche, and Judd Apatow. This is Al Jean's 13th consecutive season as showrunner and 15th overall. Matt Groening, James L. Brooks, Matt Selman, and John Frink serve as executive producers.","episode_count":22,"name":"Season 25","season_number":25,"id":3606,"poster_path":"\/e0MUnARB8E0BmtHpEvE1Xu1RR3Y.jpg"},{"air_date":"2014-09-28","overview":"The Simpsons' twenty-sixth season premiered on September 28, 2014 and concluded on May 17, 2015.\n\nIn this season, Krusty the Clown retires after his father dies (\"Clown in the Dumps\"); Homer and Bart attempt to solve some father\/son conflicts (\"The Wreck of the Relationship\"); Marge opens a sandwich franchise (\"Super Franchise Me\"); the Simpsons meet their former (The Tracey Ullman Show) selves (\"Treehouse of Horror XXV\"); Mr. Burns finds a girlfriend in Democratic Assemblywoman Maxine Lombard (\"Opposites A-Frack\"); Bart schemes to bring down his new fourth grade teacher, Mr. Lassen (guest voice Willem Dafoe), who is a terrible bully (\"Blazed and Confused\"); Homer has a mid-life crisis (\"Covercraft\"); and the cast of Futurama make an appearance in Springfield in a crossover episode (\"Simpsorama\").","episode_count":22,"name":"Season 26","season_number":26,"id":62103,"poster_path":"\/n4BUAp24PFUG8r5NjRfAHNzcQYO.jpg"},{"air_date":"2015-09-27","overview":"","episode_count":22,"name":"Season 27","season_number":27,"id":68067,"poster_path":"\/z2YTJvSeHC3gqilaAb92ONC6IFn.jpg"},{"air_date":"2016-09-25","overview":"","episode_count":22,"name":"Season 28","season_number":28,"id":80361,"poster_path":"\/iuwQTFzfJeOIPzM6MBUBFWek52Z.jpg"},{"air_date":"2017-10-01","overview":"","episode_count":21,"name":"Season 29","season_number":29,"id":91255,"poster_path":"\/dyAmKsbCfZAj5lSnWpYiMazHZ4K.jpg"},{"air_date":"2018-09-30","overview":"","episode_count":6,"name":"Season 30","season_number":30,"id":110088,"poster_path":"\/sj24nG5NSTiz8kR7YstmTR3h1AQ.jpg"}],"rating":7.1,"serieType":[16,35],"id":456,"title":"The Simpsons"},{"summary":"Spoiled billionaire playboy Oliver Queen is missing and presumed dead when his yacht is lost at sea. He returns five years later a changed man, determined to clean up the city as a hooded vigilante armed with a bow.","date":"2012-10-10","imageLink":"\/mo0FP1GxOFZT4UDde7RFDz5APXF.jpg","seasons":[{"air_date":"2013-10-02","overview":"","episode_count":8,"name":"Specials","season_number":0,"id":3698,"poster_path":"\/arpvBHZRhLjDLKGg2ZL8cYMy35I.jpg"},{"air_date":"2012-10-10","overview":"Oliver Queen returns to Starling city after being deserted on a hellish island for five years. He decides to become a mask wearing vigilante to fulfil his father's wishes and rid the city of crime. In his journey to do so, he is forced to make tough decisions even as he makes new friends and even more enemies which continue question his lethal ways of controlling crime.","episode_count":23,"name":"Season 1","season_number":1,"id":3697,"poster_path":"\/AlzF0mWXN1ORPUVYAHHRan2j7ji.jpg"},{"air_date":"2013-10-09","overview":"At the end of Season 1, Starling city suffered a huge loss and so did Oliver Queen. Learning from his mistakes, Oliver decides to change his methods even while honouring his promises to his friend. Meanwhile a new enemy from his past resurfaces to make life difficult for Oliver. ","episode_count":23,"name":"Season 2","season_number":2,"id":3699,"poster_path":"\/e6v6RUzAW7xO6OBeLtfOhlCawz6.jpg"},{"air_date":"2014-10-08","overview":"Having achieved true hero status - Oliver Queen faces new challenges with a foe who has come back from the dead. This time, he has help in the form a new hero\/side kick and a lot of familiar faces. There is also a new player - Ray Palmer (future atom) - in the mix, who has a new vision for turning Starling City into Star City.","episode_count":23,"name":"Season 3","season_number":3,"id":62018,"poster_path":"\/3bRWPv2IK1ZSSiwp3csmDfKCGq5.jpg"},{"air_date":"2015-10-07","overview":"After defeating his most formidable foe to date and riding off into the sunset with longtime flame Felicity Smoak, Oliver Queen (aka The Arrow) left Starling City with the hopes of beginning a new life. But will Oliver ever truly be able to leave behind his past as the Arrow, and, if so, what becomes of the team he has worked so hard to assemble? Will military vet John Diggle, Oliver’s sister Thea Queen, and lawyer-turned-vigilante Laurel Lance be left to continue Oliver's crusade without him? And with Malcolm Merlyn having ascended to the top of the League of Assassins as the new Ra's al Ghul, is anyone really safe? The action-packed series continues with new villains, new heroes and new challenges!","episode_count":23,"name":"Season 4","season_number":4,"id":67989,"poster_path":"\/jgP3f5jWZFW4pPryf4IfWqVepEp.jpg"},{"air_date":"2016-10-05","overview":"","episode_count":23,"name":"Season 5","season_number":5,"id":79710,"poster_path":"\/uzGRZtaDTh0nKruS0raXVZnGQAj.jpg"},{"air_date":"2017-10-12","overview":"","episode_count":23,"name":"Season 6","season_number":6,"id":90327,"poster_path":"\/nBkw9ebhlkQMJYzCbYc0twWe8US.jpg"},{"air_date":"2018-10-15","overview":"","episode_count":4,"name":"Season 7","season_number":7,"id":105512,"poster_path":"\/mt69fT734ZpiyTxo4nqnpL8tPoL.jpg"}],"rating":6,"serieType":[80,18,9648,10759],"id":1412,"title":"Arrow"},{"summary":"When they were boys, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force. Subsequently, their father raised them to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America ... and he taught them how to kill it. Now, the Winchester brothers crisscross the country in their '67 Chevy Impala, battling every kind of supernatural threat they encounter along the way. ","date":"2005-09-13","imageLink":"\/pui1V389cQft0BVFu9pbsYLEW1Q.jpg","seasons":[{"air_date":null,"overview":"","episode_count":3,"name":"Specials","season_number":0,"id":6902,"poster_path":"\/6VmmiImmxcspyjcm4qKLGVYlPh6.jpg"},{"air_date":"2005-09-13","overview":"The Creepy. The Demented. The Unexplained. The Unearthly. Sam Winchester grew up hunting such terrifying things. But that’s all past. Law school beckons him. So does safety and normalcy. That is, until Sam’s estranged brother Dean appears with troubling news: their father has disappeared, a man who’s hunted evil for 22 years. So to find their father, the brothers must hunt what their father hunts…and Sam must return to the life he’d rather leave behind.","episode_count":22,"name":"Season 1","season_number":1,"id":6904,"poster_path":"\/fFn80y3PPmCcTbIIjQS5ft0jNFc.jpg"},{"air_date":"2006-09-28","overview":"They're back the ghouls and vampires, the ghosts and spirits and even more terrifying entities. And wherever these evil beings are, you'll find brothers Sam and Dean Winchester, hunters on the trail of the demon who murdered their mother…and of any other unholy agent of the Supernatural. Join the brothers in their mind-bending, bone-chilling Season 2 road trip across America a journey deeper into the mystery of their own destinies.","episode_count":22,"name":"Season 2","season_number":2,"id":6905,"poster_path":"\/235GDaro5DuRJ9ogXmV7tOB6W5j.jpg"},{"air_date":"2007-10-04","overview":"The yellow-eyed demon is vanquished, but at a terrible price. The battle that brought him down released hundreds of demons from Hell into an unsuspecting world. And it cost Sam his life. But a grief-stricken Dean made a deal with the Crossroad Demon: his soul for Sam's resurrection. Now Dean has just one year to live. One year to fight the unholy, the twisted, the ghoulish. One year to say farewell to Sam. And one year for Sam to search desperately for some way to save his brother. Mind-bending adventure awaits as the Winchester brothers continue their astonishing odyssey into the supernatural...and their personal odyssey into destiny.","episode_count":16,"name":"Season 3","season_number":3,"id":6906,"poster_path":"\/vDIg3XI9JHfEORxTWstO2seUyCw.jpg"},{"air_date":"2008-09-18","overview":"Resurrection. After enduring unspeakable torture, Dean escapes from Hell, rescued by an all-powerful creature he's never seen before an Angel a warrior of God who recruits Sam and Dean in Heaven's battle against Hell. And there are whispers that a certain fallen angel will soon be freed from his prison deep in Hell: Lucifer. If Sam and Dean can't stop it if Lucifer walks free he'll bring on the Apocalypse. Meanwhile, the Winchester brothers reunite and hit the road, battling the supernatural wherever they go. They encounter demons, spirits, Dracula himself and even a drunk, heavily armed seven-foot-tall teddy bear. All the while, the ultimate war draws them into its horror. Caught between Heaven and Hell, between God and the Devil, the Winchester brothers must battle for the future of humankind.","episode_count":22,"name":"Season 4","season_number":4,"id":6907,"poster_path":"\/uswpAvIhUX98ybJEJYJp6EUe3d6.jpg"},{"air_date":"2009-09-10","overview":"Two brothers and one fallen angel - against all the might of Satan and his army! As the Apocalypse grows closer, threatening to turn Earth into a battlefield soaked with human blood, Sam, Dean and Castiel struggle against daunting odds. New foes arise, including the Four Horsemen of the Apocalypse. Old friends depart, consumed by the fearsome wrath of Hell. Through it all, the Winchesters are targeted by demons and angels alike, who warn that each brother has a special and terrible role to play in the coming devastation. Season Five follows Sam and Dean on their most terrifying journey yet, one that may lead them to the only ally strong enough to defeat the Devil: God.","episode_count":22,"name":"Season 5","season_number":5,"id":6908,"poster_path":"\/5BhXiXHjAq2LS7VyyiAA6egpZb8.jpg"},{"air_date":"2010-09-24","overview":" The prize: ending the Apocalypse. The price: Sam's life. Season 5's horrific finale left Dean alone, as Sam descended into Hell. Now a different man, Dean vows to stop hunting and devote himself to building a family with Lisa and her son Ben. Then, mysteriously, Sam reappears, drawing Dean back into the old life. But Sam's a different man too. He's returned without his soul. How the Winchesters confront this greatest challenge yet to their powerful bond is the troubled heart - and soul - of the profound and thrilling 22-Episode Season 6. As the brothers struggle to reunite, they must also battle deadly supernatural forces. Demons. Angels. Vampires. Shapeshifters. And a terrifying new foe called the Mother of All.","episode_count":22,"name":"Season 6","season_number":6,"id":6909,"poster_path":"\/hGInmwwUlG3yvrvSH9CYcL6Ba1j.jpg"},{"air_date":"2011-09-23","overview":" In Season 7, Sam and Dean fight demons. Real demons, like Lucifer, who tortures Sam with visions of Hell. Private demons, as the brothers face a traumatic personal loss when Bobby is cut down by alien forces. And as Sam and Dean travel the back roads of America, hunting monsters who wreak havoc on the innocent, a new and more terrible foe hunts them: Leviathans, freed from Purgatory and immune to the brothers' arsenal of weapons and cunning. With Bobby gone, all Sam and Dean can rely on is each other. But will that be enough?","episode_count":23,"name":"Season 7","season_number":7,"id":6910,"poster_path":"\/qiuf2qxR2Zd5sInYytZzSIXbUuL.jpg"},{"air_date":"2012-10-03","overview":"After a year apart, Sam and Dean are reunited in the Eighth Season premiere. After escaping from Purgatory with the help of a vampire named Benny, Dean heads straight for Sam, but the reunion isn't exactly everything he imagined it would be. Although Sam drops everything to join his brother, leaving the life he had grown accustomed to enjoy turns out to be harder than he imagined. In the meantime, Benny’s help turns out to be more than what Dean bargained for. As the brothers struggle with their unexpected reunion, they make a shocking discovery that could lead them on a deeply personal mission to settle old scores. If only they could agree – is this a “family business” or isn’t it?","episode_count":23,"name":"Season 8","season_number":8,"id":6911,"poster_path":"\/pmzX28gvLj52HtN5qeyb1Qw4q5l.jpg"},{"air_date":"2013-10-08","overview":" After defeating the Leviathan, Sam and Dean set off on an epic quest to seal the Gates of Hell last season. Facing a series of trials, the Winchesters soon found themselves in the middle of an age-old power struggle between the King of Hell and legions of warrior angels. But with the angels cast out of heaven and walking the earth, things just got very unpredictable.","episode_count":23,"name":"Season 9","season_number":9,"id":6903,"poster_path":"\/gzxekP92imqSSq6FhagISMTr3dg.jpg"},{"air_date":"2014-10-07","overview":"Season 10 begins with Sam’s frantic search for his missing brother, who is gone without a trace. The road to recovering the wayward Dean takes Sam down dark paths, with consequences that will shake the boys to their core. Meanwhile, Castiel has to pick up the pieces in the aftermath of Metatron’s campaign. With his grace failing and rogue angels still on the loose, Cas will face the ticking clock of his own mortality as all-new threats emerge to once again push all of our heroes to their limits.","episode_count":23,"name":"Season 10","season_number":10,"id":62088,"poster_path":"\/60iYy9SYG74duc91JLKpsEQG3AS.jpg"},{"air_date":"2015-10-07","overview":"Following the release of the Darkness, this season follows the Winchesters and their allies as they find themselves fighting the most powerful supernatural entity they've ever faced.","episode_count":23,"name":"Season 11","season_number":11,"id":70169,"poster_path":"\/ye95dj8FL4Me65bLnrXWo3Sk74Z.jpg"},{"air_date":"2016-10-13","overview":"In the show's eleventh season, the Winchesters found themselves battling an apocalyptic force: the Darkness. Now, rallying help from their allies - both human and supernatural - Sam and Dean are about to go toe-to-toe with the most destructive enemy they've ever seen. The question is, will they win? And at what price?","episode_count":23,"name":"Season 12","season_number":12,"id":78350,"poster_path":"\/gkNzVg2k8dF6mXsMnjhaMX1NpUy.jpg"},{"air_date":"2017-10-12","overview":"Season 13 begins exactly where we left off, with Sam and Dean left to pick up the pieces after the loss of their mother, the demise of Crowley and the heartbreaking death of Castiel. The birth of Jack leaves the Winchester brothers with differing opinions on how to deal with a Nephilim. After being dragged into the breach, Mary must learn to survive Lucifer and an apocalyptic world.","episode_count":23,"name":"Season 13","season_number":13,"id":92695,"poster_path":"\/gzOwgQxjT477jcHRI6PUGDJuMZu.jpg"},{"air_date":"2018-10-11","overview":"","episode_count":8,"name":"Season 14","season_number":14,"id":105970,"poster_path":"\/jbUJjcQsCgNlhgo4L0O8RQZqQLx.jpg"}],"rating":7.2,"serieType":[18,9648,10765],"id":1622,"title":"Supernatural"},{"summary":"The Doctor is a Time Lord: a 900 year old alien with 2 hearts, part of a gifted civilization who mastered time travel. The Doctor saves planets for a living – more of a hobby actually, and the Doctor's very, very good at it.","date":"2005-03-26","imageLink":"\/3EcYZhBMAvVw4czcDLg9Sd0FuzQ.jpg","seasons":[{"air_date":"2005-11-18","overview":"The specials of the British science fiction television series Doctor Who include the yearly Christmas specials as well as anniversary episodes, preview episodes, webisodes, and all other non-season episodes.  Also included is the series Doctor Who Extra.","episode_count":148,"name":"Specials","season_number":0,"id":58476,"poster_path":"\/Shm5ZavLApx6HMFWviKP5Sx1J8.jpg"},{"air_date":"2005-03-26","overview":"","episode_count":13,"name":"Series 1","season_number":1,"id":58468,"poster_path":"\/9Jt2FFCAME7eHDC28r4qCHErhhF.jpg"},{"air_date":"2006-04-15","overview":"","episode_count":13,"name":"Series 2","season_number":2,"id":58469,"poster_path":"\/oXVmsIkZCgJDNcZJJxzvV7zwyb1.jpg"},{"air_date":"2007-04-01","overview":"","episode_count":13,"name":"Series 3","season_number":3,"id":58470,"poster_path":"\/67xbjSv353G2rqQIs6dnDKc6P11.jpg"},{"air_date":"2008-04-05","overview":"","episode_count":13,"name":"Series 4","season_number":4,"id":58471,"poster_path":"\/h6hogh9U371q87XLhvrJbczg8lm.jpg"},{"air_date":"2010-04-03","overview":"","episode_count":13,"name":"Series 5","season_number":5,"id":58472,"poster_path":"\/hUsQerEeMqsu9cVYzMEB2OGJjrw.jpg"},{"air_date":"2011-04-23","overview":"The Doctor returns, alongside newly weds Amy and Rory, to face monsters and mysteries and adventures all across time and space. Together they find themselves in sixties America, battling the invasion the world forgot, then aboard a pirate ship on the high seas of 1696, to solve the mystery of the Siren. In a bubble universe at the edge of reality, the Doctor meets an old friend with a new face.","episode_count":13,"name":"Series 6","season_number":6,"id":58473,"poster_path":"\/xmfMcVkVer5r33QhA4e2DpIR78B.jpg"},{"air_date":"2012-09-01","overview":"Doctor Who's seventh series was the show's third and final series in which Matt Smith, Karen Gillan and Arthur Darvill played the eleventh incarnation of the Doctor and his companions Amy Pond and Rory Williams respectively. Gillan and Darvill departed the series in the fifth episode, after which a new companion named Clara Oswald joined the Doctor, played by Jenna-Louise Coleman, remaining with the series for its second half. Smith stayed for one year longer than Gillan and Darvill, and will depart the series after the 2013 specials.","episode_count":13,"name":"Series 7","season_number":7,"id":58474,"poster_path":"\/6biGcR0OyFnKRxxUW7bGtK49wTd.jpg"},{"air_date":"2014-08-23","overview":"The season ushers in an exciting new era for the show as Peter Capaldi steps into the role of the Doctor. Fans first got a glimpse of Capaldi's Doctor in November's 50th Anniversary Special, and again in the final minutes of last year's Christmas Special, but the upcoming season premiere marks the first full episode for the Twelfth Doctor. Capaldi will be joined by Jenna Coleman, who returns as companion Clara Oswald, and Samuel Anderson who joins the cast as Danny Pink, a teacher at Coal Hill School where Clara also works.","episode_count":12,"name":"Series 8","season_number":8,"id":58475,"poster_path":"\/wLxULmhnIM1wbzjzvFnEq8YXtFB.jpg"},{"air_date":"2015-09-19","overview":"Now that the Doctor and Clara have established a dynamic as a partnership of equals, they’re relishing the fun and thrills that all of space and time has to offer. Tangling with ghosts, Vikings and the ultimate evil of the Daleks, they embark on their biggest adventures yet. Missy is back to plague the Doctor once more, the Zygons inspire fear as they shape-shift into human clones, and a new arrival moves in cosmic ways.","episode_count":12,"name":"Series 9","season_number":9,"id":64188,"poster_path":"\/uidaCdI0hKiZGfMzWHNMYeNZyV7.jpg"},{"air_date":"2017-04-15","overview":"Doctor Who, Season 10 sees Peter Capaldi embark on his thrilling final chapter as the Twelfth Doctor as well as the introduction of brand new companion Pearl Mackie as Bill Potts and the return of Matt Lucas as Nardole. Fantastic adventures and terrifying monsters await the team of heroes as they journey through space and time. Expect laughter, danger and exhilarating escapades in this final season under the helm of lead writer and executive producer Steven Moffat.","episode_count":12,"name":"Series 10","season_number":10,"id":76615,"poster_path":"\/8HPLQQqTPfy7Oiligw9FXcfig9w.jpg"},{"air_date":"2018-10-07","overview":"","episode_count":4,"name":"Series 11","season_number":11,"id":97100,"poster_path":"\/3EcYZhBMAvVw4czcDLg9Sd0FuzQ.jpg"}],"rating":7,"serieType":[18,10759,10765],"id":57243,"title":"Doctor Who"},{"summary":"Twenty-four-year-old Kara Zor-El, who was taken in by the Danvers family when she was 13 after being sent away from Krypton, must learn to embrace her powers after previously hiding them. The Danvers teach her to be careful with her powers, until she has to reveal them during an unexpected disaster, setting her on her journey of heroism.","date":"2015-10-26","imageLink":"\/vqBsgL9nd2v04ZvCqPzwtckDdFD.jpg","seasons":[{"air_date":null,"overview":"","episode_count":0,"name":"Specials","season_number":0,"id":102301,"poster_path":null},{"air_date":"2015-10-26","overview":"","episode_count":20,"name":"Season 1","season_number":1,"id":66734,"poster_path":"\/40irkee2qIWZuq8RCI8r0hlMWB8.jpg"},{"air_date":"2016-10-09","overview":"","episode_count":22,"name":"Season 2","season_number":2,"id":78870,"poster_path":"\/qcp7tBPNxW5NtyoLlDXQxIRwkKw.jpg"},{"air_date":"2017-10-09","overview":"","episode_count":23,"name":"Season 3","season_number":3,"id":90431,"poster_path":"\/oNOXcu8SdfSAHfHGnpb7NvcFLww.jpg"},{"air_date":"2018-10-14","overview":"In season four, Supergirl is facing a bigger threat than she’s ever faced before – a new wave of anti-alien sentiment, spreading across National City that’s fomented by Agent Liberty. As Kara mentors a new reporter at CatCo, Nia Nal, and tries to use the power of the press to shine a light on the issues threatening to tear the city apart, Supergirl takes to the skies to battle the many villains who rise up in this era of divisiveness.","episode_count":4,"name":"Season 4","season_number":4,"id":105511,"poster_path":"\/ivqcndOjIWBuDJBjcFmtzehBzET.jpg"}],"rating":5.8,"serieType":[28,12,18,878],"id":62688,"title":"Supergirl"},{"summary":"In the criminal justice system, sexually-based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.","date":"1999-09-20","imageLink":"\/ydSvHgksuB8Ix0V05QEZBKrnIcg.jpg","seasons":[{"air_date":null,"overview":"","episode_count":9,"name":"Specials","season_number":0,"id":8888,"poster_path":null},{"air_date":"1999-09-20","overview":"Law & Order: Special Victims Unit, an American police procedural television series, premiered on September 20, 1999 on NBC. Created by Dick Wolf, it is the first spin-off of Law & Order and follows the detectives of a fictionalized version of the New York City Police Department's Special Victims Unit, which investigates sexually based offenses. SVU originally aired on Monday nights at 9:00 p.m. EST, but it was moved to Friday nights at 10:00 p.m. after the ninth episode. Showrunner Robert Palm felt too disturbed by the subject matter and left after the season's conclusion.","episode_count":22,"name":"Season 1","season_number":1,"id":8878,"poster_path":"\/qMME7c87wyvvjy79vq1AUItgNX5.jpg"},{"air_date":"2000-10-20","overview":"The 2nd season of the television series, Law & Order: Special Victims Unit premiered October 20, 2000 and ended May 11, 2001 on NBC. The show remained in its time slot, Friday nights at 10:00 p.m. Eastern \/ 9:00 p.m. Central. As Neal Baer's first year producing the show, the second season was accompanied by drastic changes in tone. Additionally, the series began to increase its focus on trial scenes with the addition of an Assistant District Attorney for sex crimes to the cast.","episode_count":21,"name":"Season 2","season_number":2,"id":8877,"poster_path":"\/fPzJ7U7YphQdoBiGKI32M2vEpYa.jpg"},{"air_date":"2001-09-28","overview":"The 3rd season of the television series, Law & Order: Special Victims Unit premiered Friday, September 28, 2001 and ended Friday, May 17, 2002 on NBC. It occupied the Friday 10:00 p.m. timeselot once again.","episode_count":23,"name":"Season 3","season_number":3,"id":8876,"poster_path":"\/8n0eCjSspHz5TGrTsQtCrYUSQ8I.jpg"},{"air_date":"2002-09-27","overview":"The 4th season of the television series, Law & Order: Special Victims Unit premiered September 27, 2002 and ended May 16, 2003 on NBC. This was the last season of the series to air on Friday nights at 10:00 p.m. Eastern \/ 9:00 p.m. Central.","episode_count":25,"name":"Season 4","season_number":4,"id":8885,"poster_path":"\/68ADeZIAAXFgqBfuEeccZfDlcpm.jpg"},{"air_date":"2003-09-23","overview":"The 5th season of the television series, Law & Order: Special Victims Unit premiered September 23, 2003 and ended May 18, 2004 on NBC. Law & Order: SVU moved away from its Friday night slot to Tuesday nights at 10:00 p.m. Eastern \/ 9:00 p.m. Central. Casey Novak, the unit's longest serving ADA, was introduced in the fifth episode when Diane Neal joined the cast to fill the absence left by Stephanie March.","episode_count":25,"name":"Season 5","season_number":5,"id":8881,"poster_path":"\/aEiMYckPixeUsddttsijUyFpzYK.jpg"},{"air_date":"2004-09-21","overview":"The 6th season of the television series, Law & Order: Special Victims Unit premiered September 21, 2004 and ended May 24, 2005 on NBC. It aired on Tuesday nights at 10:00 p.m. In January 2005, when the season was halfway through airing, Mariska Hargitay won the Golden Globe Award for Best Actress - Television Series Drama becoming the first regular cast member of any Law & Order series to win a Golden Globe.","episode_count":23,"name":"Season 6","season_number":6,"id":8880,"poster_path":"\/p3iU1fLz9h8O1d6g4KrOzKbU2vq.jpg"},{"air_date":"2005-09-20","overview":"The 7th season of the television series, Law & Order: Special Victims Unit premiered September 20, 2005 and ended May 16, 2006 on NBC. It aired on Tuesday nights at 10:00 p.m. Critically the show's most successful season, both lead actors received nominations at the 2006 Emmy Awards with a win by Mariska Hargitay.","episode_count":22,"name":"Season 7","season_number":7,"id":8884,"poster_path":"\/nyxKV9Eh7bqmtxFjFLDEopttXZs.jpg"},{"air_date":"2006-09-19","overview":"The 8th season of the television series, Law & Order: Special Victims Unit premiered September 19, 2006 and ended May 22, 2007 on NBC. The series remained in its 10:00 p.m. Tuesday timeslot. With the introduction of a new partner for Detective Stabler, early episodes of Season 8 took on a significantly different focus when compared to those of previous seasons.","episode_count":22,"name":"Season 8","season_number":8,"id":8879,"poster_path":"\/mvNHgkbvREA6ty5lJpW4Dj0ks7L.jpg"},{"air_date":"2007-09-25","overview":"The 9th season of the police procedural \/ legal drama, Law & Order: Special Victims Unit premiered September 25, 2007 and ended May 13, 2008 on NBC. It aired on Tuesday nights at 10:00 p.m. Eastern \/ 9:00 p.m. Central. Mariska Hargitay, having won a Golden Globe Award in 2005, received her second Golden Globe nomination for her work in the ninth season.","episode_count":19,"name":"Season 9","season_number":9,"id":8882,"poster_path":"\/hSJbnNHL2Hlm6HO2JzrT0s4vNVZ.jpg"},{"air_date":"2008-09-23","overview":"The 10th season of the police procedural \/ legal drama, Law & Order: Special Victims Unit premiered September 23, 2008 and ended June 2, 2009 on NBC. It was the last season of the show to occupy the Tuesday 10:00 p.m. timeslot.","episode_count":22,"name":"Season 10","season_number":10,"id":8883,"poster_path":"\/j2qRsT11WL8sX1ULWWxS7opu8Dj.jpg"},{"air_date":"2009-09-23","overview":"The 11th season of Law & Order: Special Victims Unit premiered on September 23, 2009 and concluded on May 19, 2010. It was moved from Tuesdays to Wednesdays at 9 p.m. ET for the NBC broadcast. On March 3, 2010 SVU returned to its previous time slot of 10 p.m. ET. On January 22, 2010, in the wake of the conflict between Jay Leno and Conan O'Brien, NBC announced that they would order two additional episodes to fill in the gaps of the departing The Jay Leno Show.","episode_count":24,"name":"Season 11","season_number":11,"id":8886,"poster_path":"\/bcuIWfuiH7Tq9YGSQQZfZmf8UYJ.jpg"},{"air_date":"2010-09-22","overview":"The 12th season of Law & Order: Special Victims Unit premiered in the United States on the National Broadcasting Company on September 22, 2010, and concluded on May 18, 2011. This was the first season that the show did not air alongside the original Law & Order. Episodes initially aired on Wednesdays between 9 and 10 p.m. Eastern except for the season premiere which aired from 9 to 11. After the winter hiatus, SVU returned with another two-hour showing on January 5, 2011, before the broadcast time switched to the 10 p.m. time slot the following week.\n\nAt the end of the season, Neal Baer resigned his position as showrunner. After the season finale, Christopher Meloni and B.D. Wong both left the cast.","episode_count":24,"name":"Season 12","season_number":12,"id":8887,"poster_path":"\/igsSNddE8ROWQ19pl88Frx8hKOa.jpg"},{"air_date":"2011-09-21","overview":"The 13th season of Law & Order: Special Victims Unit debuted on NBC on September 21, 2011, and concluded on May 23, 2012. With Law & Order: LA and Law & Order: Criminal Intent having ended in May 2011 and June 2011 respectively, this season of Law & Order: SVU was broadcast without any other running U.S. Law & Order series.\n\nSeason 13 dealt with the departure of Detective Elliot Stabler from the Special Victims Unit after a shooting in the squad room. Additionally, Warren Leight became the executive producer \/ showrunner for the series replacing Neal Baer who began working on a CBS medical drama.","episode_count":23,"name":"Season 13","season_number":13,"id":8889,"poster_path":"\/noc79PeGMcZw2qCiVbyQV8B6q42.jpg"},{"air_date":"2012-09-26","overview":"The 14th season of Law & Order: Special Victims Unit debuted with a two-part premiere episode on September 26, 2012, at 9:00 pm on NBC, which was the show's weekly time slot.\n\nThe fourteenth season picked up storyline-wise where the last season left off, with Captain Cragen awaking to a dead prostitute in his bed with her throat slit. The two-part season premiere was watched by 7.19 million total viewers and received generally positive reviews. The series' landmark 300th episode fell this season and aired on October 24, 2012, watched by 6.77 million total viewers. This is the first season of SVU to have any kind of crossover with now ended Law & Order spinoff, Law & Order: Criminal Intent, Kathryn Erbe guest starring in two episodes \"Acceptable Loss\" and Poisoned Motive as her LOCI character, Alexandra Eames, and Denis O'Hare guest starring in the episode \"Presumed Guilty\" as his LOCI character, Father Shea.","episode_count":24,"name":"Season 14","season_number":14,"id":8890,"poster_path":"\/mkdMIq9YYfKQXVB48otcbSr3m04.jpg"},{"air_date":"2013-09-25","overview":"The 15th season of Law & Order: Special Victims Unit made its debut with a 2–hour premiere episode on September 25, 2013, at 9:00 pm on NBC.","episode_count":24,"name":"Season 15","season_number":15,"id":8891,"poster_path":"\/9unR6QVh6WBiAv0CK1admWtM8Tx.jpg"},{"air_date":"2014-09-24","overview":"","episode_count":23,"name":"Season 16","season_number":16,"id":62900,"poster_path":"\/fxONX6Mav1LUxtEfMVfRnThUoUw.jpg"},{"air_date":"2015-09-23","overview":"","episode_count":23,"name":"Season 17","season_number":17,"id":68816,"poster_path":"\/ncwK9fT1cxV5LIZkRLhScd0ksFO.jpg"},{"air_date":"2016-09-21","overview":"","episode_count":21,"name":"Season 18","season_number":18,"id":79484,"poster_path":"\/4QdKXQf1NhxpcTYZJ8Frf7RwHV4.jpg"},{"air_date":"2017-09-27","overview":"","episode_count":24,"name":"Season 19","season_number":19,"id":91257,"poster_path":"\/yzMQBlirydvKp4Zgr5FbXlsrRmw.jpg"},{"air_date":"2018-09-27","overview":"","episode_count":8,"name":"Season 20","season_number":20,"id":105509,"poster_path":"\/yb8dhag59L0JKAVh1Yz1i1MJW4f.jpg"}],"rating":6.2,"serieType":[80,18],"id":2734,"title":"Law & Order: Special Victims Unit"},{"summary":"Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and icy horrors beyond.","date":"2011-04-17","imageLink":"\/gwPSoYUHAKmdyVywgLpKKA4BjRr.jpg","seasons":[{"air_date":"2010-12-05","overview":"","episode_count":14,"name":"Specials","season_number":0,"id":3627,"poster_path":"\/kMTcwNRfFKCZ0O2OaBZS0nZ2AIe.jpg"},{"air_date":"2011-04-17","overview":"Trouble is brewing in the Seven Kingdoms of Westeros. For the driven inhabitants of this visionary world, control of Westeros' Iron Throne holds the lure of great power. But in a land where the seasons can last a lifetime, winter is coming...and beyond the Great Wall that protects them, an ancient evil has returned. In Season One, the story centers on three primary areas: the Stark and the Lannister families, whose designs on controlling the throne threaten a tenuous peace; the dragon princess Daenerys, heir to the former dynasty, who waits just over the Narrow Sea with her malevolent brother Viserys; and the Great Wall--a massive barrier of ice where a forgotten danger is stirring.","episode_count":10,"name":"Season 1","season_number":1,"id":3624,"poster_path":"\/zwaj4egrhnXOBIit1tyb4Sbt3KP.jpg"},{"air_date":"2012-04-01","overview":"The cold winds of winter are rising in Westeros...war is coming...and five kings continue their savage quest for control of the all-powerful Iron Throne. With winter fast approaching, the coveted Iron Throne is occupied by the cruel Joffrey, counseled by his conniving mother Cersei and uncle Tyrion. But the Lannister hold on the Throne is under assault on many fronts. Meanwhile, a new leader is rising among the wildings outside the Great Wall, adding new perils for Jon Snow and the order of the Night's Watch.","episode_count":10,"name":"Season 2","season_number":2,"id":3625,"poster_path":"\/5tuhCkqPOT20XPwwi9NhFnC1g9R.jpg"},{"air_date":"2013-03-31","overview":"Duplicity and treachery...nobility and honor...conquest and triumph...and, of course, dragons. In Season 3, family and loyalty are the overarching themes as many critical storylines from the first two seasons come to a brutal head. Meanwhile, the Lannisters maintain their hold on King's Landing, though stirrings in the North threaten to alter the balance of power; Robb Stark, King of the North, faces a major calamity as he tries to build on his victories; a massive army of wildlings led by Mance Rayder march for the Wall; and Daenerys Targaryen--reunited with her dragons--attempts to raise an army in her quest for the Iron Throne.","episode_count":10,"name":"Season 3","season_number":3,"id":3626,"poster_path":"\/7d3vRgbmnrRQ39Qmzd66bQyY7Is.jpg"},{"air_date":"2014-04-06","overview":"The War of the Five Kings is drawing to a close, but new intrigues and plots are in motion, and the surviving factions must contend with enemies not only outside their ranks, but within.","episode_count":10,"name":"Season 4","season_number":4,"id":3628,"poster_path":"\/dniQ7zw3mbLJkd1U0gdFEh4b24O.jpg"},{"air_date":"2015-04-12","overview":"The War of the Five Kings, once thought to be drawing to a close, is instead entering a new and more chaotic phase. Westeros is on the brink of collapse, and many are seizing what they can while the realm implodes, like a corpse making a feast for crows.","episode_count":10,"name":"Season 5","season_number":5,"id":62090,"poster_path":"\/527sR9hNDcgVDKNUE3QYra95vP5.jpg"},{"air_date":"2016-04-24","overview":"Following the shocking developments at the conclusion of season five, survivors from all parts of Westeros and Essos regroup to press forward, inexorably, towards their uncertain individual fates. Familiar faces will forge new alliances to bolster their strategic chances at survival, while new characters will emerge to challenge the balance of power in the east, west, north and south.","episode_count":10,"name":"Season 6","season_number":6,"id":71881,"poster_path":"\/zvYrzLMfPIenxoq2jFY4eExbRv8.jpg"},{"air_date":"2017-07-16","overview":"The long winter is here. And with it comes a convergence of armies and attitudes that have been brewing for years.","episode_count":7,"name":"Season 7","season_number":7,"id":81266,"poster_path":"\/3dqzU3F3dZpAripEx9kRnijXbOj.jpg"},{"air_date":null,"overview":"","episode_count":6,"name":"Season 8","season_number":8,"id":107971,"poster_path":"\/nMbQUpSpdscUKMBd9zQJ1rzxXQK.jpg"}],"rating":8.2,"serieType":[18,10759,10765],"id":1399,"title":"Game of Thrones"},{"summary":"Sick, twisted, politically incorrect and Freakin' Sweet animated series featuring the adventures of the dysfunctional Griffin family. Bumbling Peter and long-suffering Lois have three kids. Stewie (a brilliant but sadistic baby bent on killing his mother and taking over the world), Meg (the oldest, and is the most unpopular girl in town) and Chris (the middle kid, he's not very bright but has a passion for movies). The final member of the family is Brian - a talking dog and much more than a pet, he keeps Stewie in check whilst sipping Martinis and sorting through his own life issues.","date":"1999-01-31","imageLink":"\/gBGUL1UTUNmdRQT8gA1LUV4yg39.jpg","seasons":[{"air_date":"2006-05-21","overview":"","episode_count":21,"name":"Specials","season_number":0,"id":3831,"poster_path":"\/clXAuMUd5ROYlUAic1lNUozvyWv.jpg"},{"air_date":"1999-01-31","overview":"","episode_count":7,"name":"Season 1","season_number":1,"id":3821,"poster_path":"\/eP3u5f6Z22lj0ebpf2bBwiGd2eZ.jpg"},{"air_date":"1999-09-23","overview":"","episode_count":21,"name":"Season 2","season_number":2,"id":3822,"poster_path":"\/3yashkzA2PJUtEKWsrA80OVoeSc.jpg"},{"air_date":"2001-07-11","overview":"","episode_count":22,"name":"Season 3","season_number":3,"id":3823,"poster_path":"\/16xw1hzmvRG5wxd7U3VZ0aYDLso.jpg"},{"air_date":"2005-05-01","overview":"","episode_count":30,"name":"Season 4","season_number":4,"id":3824,"poster_path":"\/vOTmOo347IFIwf55VNQHC8715wd.jpg"},{"air_date":"2006-09-10","overview":"","episode_count":18,"name":"Season 5","season_number":5,"id":3825,"poster_path":"\/Aa7kGm3hLZsCp6NGdCL2SiXb8ID.jpg"},{"air_date":"2007-09-23","overview":"","episode_count":12,"name":"Season 6","season_number":6,"id":3826,"poster_path":"\/m56KrD01tzNosO5rZFfiL9KXkhf.jpg"},{"air_date":"2008-09-28","overview":"","episode_count":16,"name":"Season 7","season_number":7,"id":3827,"poster_path":"\/zRvz9zbQd3Eco6fgsrzIUErCCcK.jpg"},{"air_date":"2009-09-27","overview":"","episode_count":20,"name":"Season 8","season_number":8,"id":3828,"poster_path":"\/s2uIM2FdHV93lJJ6as3z3Tf43cA.jpg"},{"air_date":"2010-09-26","overview":"","episode_count":18,"name":"Season 9","season_number":9,"id":3829,"poster_path":"\/7X03LG4vK2pFS6C8PxgC0QydWdR.jpg"},{"air_date":"2011-09-25","overview":"","episode_count":23,"name":"Season 10","season_number":10,"id":3830,"poster_path":"\/pFy3fQTOE4uiYp7DJTPIgKx7a3w.jpg"},{"air_date":"2012-09-30","overview":"","episode_count":22,"name":"Season 11","season_number":11,"id":3832,"poster_path":"\/zuLH8ayDlENjUQ9FYpzykABjmSK.jpg"},{"air_date":"2013-09-29","overview":"","episode_count":21,"name":"Season 12","season_number":12,"id":3833,"poster_path":"\/9O2yWdmPX0OdF5VUxoIJILhoNVb.jpg"},{"air_date":"2014-09-28","overview":"","episode_count":18,"name":"Season 13","season_number":13,"id":62024,"poster_path":"\/xo752ENE6AYiTTWA9PuOIGNnuPJ.jpg"},{"air_date":"2015-09-27","overview":"","episode_count":20,"name":"Season 14","season_number":14,"id":68069,"poster_path":"\/jrEVM9D6IaPcaplHHV6NB95M2m3.jpg"},{"air_date":"2016-09-25","overview":"","episode_count":20,"name":"Season 15","season_number":15,"id":80358,"poster_path":"\/5S5cwcpIRq6fsuF2V9G84uvM00I.jpg"},{"air_date":"2017-10-01","overview":"FAMILY GUY continues to entertain its die-hard fan base with humor, parodies, animation and orchestra-backed original music.","episode_count":20,"name":"Season 16","season_number":16,"id":93251,"poster_path":"\/acV7CapIb57hvLc6Tj63fSuRFBk.jpg"},{"air_date":"2018-09-30","overview":"FAMILY GUY continues to entertain its die-hard fan base with humor, parodies, animation and orchestra-backed original music.","episode_count":6,"name":"Season 17","season_number":17,"id":109932,"poster_path":"\/1DFGzACH8XmPXJOzwgkywQGG7Ic.jpg"}],"rating":6.5,"serieType":[16,35],"id":1434,"title":"Family Guy"},{"summary":"The Crains, a fractured family, confront haunting memories of their old home and the terrifying events that drove them from it.","date":"2018-10-12","imageLink":"\/38PkhBGRQtmVx2drvPik3F42qHO.jpg","seasons":[{"air_date":"2018-10-12","overview":"","episode_count":10,"name":"Season 1","season_number":1,"id":90484,"poster_path":"\/38PkhBGRQtmVx2drvPik3F42qHO.jpg"}],"rating":8,"serieType":[18,9648],"id":72844,"title":"The Haunting of Hill House"},{"summary":"When heroes alone are not enough ... the world needs legends. Having seen the future, one he will desperately try to prevent from happening, time-traveling rogue Rip Hunter is tasked with assembling a disparate group of both heroes and villains to confront an unstoppable threat — one in which not only is the planet at stake, but all of time itself. Can this ragtag team defeat an immortal threat unlike anything they have ever known?","date":"2016-01-21","imageLink":"\/qEobyOhOTSse59ym0gIxsQgcRGZ.jpg","seasons":[{"air_date":"2016-01-19","overview":"","episode_count":1,"name":"Specials","season_number":0,"id":73729,"poster_path":"\/4KdJBNJCELIHCWrTGPrYRxJz0rD.jpg"},{"air_date":"2016-01-21","overview":"When heroes alone are not enough… The world needs legends. Having seen the future, traveling rogue Rip Hunter assembles a disparate group of both heroes and villains to confront the unstoppable threat of the immortal Vandal Savage- a threat which not only puts the planet at stake, but all of time itself. From the creators of The Flash and Arrow comes this super hero team-up that combines characters from both shows – in addition to new heroes from the DC Comics pantheon. Featuring Arrow’s Brandon Routh as The Atom and Caity Lotz as the resurrected Sara Lance\/White Canary; with The Flash’s Victor Garber as Dr. Martin Stein alongside Wentworth Miller as Captain Cold and Dominic Purcell as Heat Wave; plus, the newest heroes Rip Hunter, Jeff Jackson and the reincarnated warrior queen Hawkgirl, this singular super hero spinoff series pits the ragtag team against one of the most powerful villains in the DC Comics universe.","episode_count":16,"name":"Season 1","season_number":1,"id":66615,"poster_path":"\/xEY4YPu7FCKQNSnMaaHo4NJl3ID.jpg"},{"air_date":"2016-10-13","overview":"Season two amps up the firepower by enlisting both a league and a legion of new characters. Joining Rex Tyler aka Hourman will be other members of the Justice Society of America. And for every force of good, there is an opposing force of darkness. The Legends of Tomorrow will face off against the first ever team of Super-Villains: the Legion of Doom, including Malcolm Merlyn, Damien Darhk, Captain Cold and the Reverse Flash. After saving the world from Vandal Savage, the Legends of Tomorrow are now charged with protecting time (past, present and future) itself, taking them across history and up against a threat unlike any humanity has ever known.","episode_count":17,"name":"Season 2","season_number":2,"id":78509,"poster_path":"\/eEbK6AJlVBtRqagPJvHk8wQ4Ktb.jpg"},{"air_date":"2017-10-10","overview":"In season three, DC’s Legends of Tomorrow face a new existential threat created by their actions at the end of last season. By revisiting a moment in time they’d already participated in, they’ve essentially fractured the timeline and created anachronisms all across time! Our team must find a way to return all the anachronisms to their original timelines before the time stream falls apart. But before our Legends can jump back into action, Rip Hunter and his newly established Time Bureau call their methods into question and disband the team. Challenging the Time Bureau’s authority, they recruit a hacker from the future, Zari Tomaz and continue their time travelling shenanigans, while insisting that however messy their methods may be, some problems are beyond the Bureau’s capabilities. Some problems can only be fixed by Legends.","episode_count":18,"name":"Season 3","season_number":3,"id":91561,"poster_path":"\/krLJpUiuJOGroJ6xvAcTQcy2iZO.jpg"},{"air_date":"2018-10-22","overview":"","episode_count":3,"name":"Season 4","season_number":4,"id":105513,"poster_path":"\/lN7Hx9MbnCbUdGAmomk6pCmUOJ8.jpg"}],"rating":6.2,"serieType":[18,10759,10765],"id":62643,"title":"DC's Legends of Tomorrow"},{"summary":"Dark Shadows is an American gothic soap opera that originally aired weekdays on the ABC television network, from June 27, 1966, to April 2, 1971. The show was created by Dan Curtis. The story bible, which was written by Art Wallace, does not mention any supernatural elements. It was unprecedented in daytime television when ghosts were introduced about six months after it began.\n\nThe series became hugely popular when vampire Barnabas Collins appeared a year into its run. Dark Shadows also featured werewolves, zombies, man-made monsters, witches, warlocks, time travel, and a parallel universe. A small company of actors each played many roles; indeed, as actors came and went, some characters were played by more than one actor. Major writers besides Art Wallace included Malcolm Marmorstein, Sam Hall, Gordon Russell, and Violet Welles.\n\nDark Shadows was distinguished by its vividly melodramatic performances, atmospheric interiors, memorable storylines, numerous dramatic plot twists, unusually adventurous music score, and broad and epic cosmos of characters and heroic adventures. Now regarded as something of a classic, it continues to enjoy an intense cult following. Although the original series ran for only five years, its scheduling as a daily daytime drama allowed it to amass more single episodes during its run than most other science-fiction\/fantasy genre series produced for English-language television, including Doctor Who and the entire Star Trek television franchise. Only the paranormal soap opera Passions, with a total of 2,231 episodes, has more.","date":"1966-06-27","imageLink":"\/y2t6w8il225T2IRsvpWJ2SzTrSn.jpg","seasons":[{"air_date":null,"overview":"","episode_count":31,"name":"Specials","season_number":0,"id":9309,"poster_path":"\/xfg24vBGoQcn1wRYtzrnfDTbfIO.jpg"},{"air_date":"1966-06-27","overview":"","episode_count":124,"name":"Season 1","season_number":1,"id":9299,"poster_path":"\/hQoSif6Ah41U1wUH2moRKARttvU.jpg"},{"air_date":"1966-12-20","overview":"","episode_count":64,"name":"Season 2","season_number":2,"id":9300,"poster_path":"\/ha1IZZ0KN88kfM3xw3R3S2A6kLA.jpg"},{"air_date":"1967-03-21","overview":"","episode_count":83,"name":"Season 3","season_number":3,"id":9297,"poster_path":"\/cfdbgIT2EQMEnzUcRlAzOqHJ8fm.jpg"},{"air_date":"1967-07-17","overview":"","episode_count":90,"name":"Season 4","season_number":4,"id":9298,"poster_path":"\/p1opR9cAkcMQunGDRBVy6PF0Xdo.jpg"},{"air_date":"1967-11-20","overview":"","episode_count":93,"name":"Season 5","season_number":5,"id":9304,"poster_path":"\/uSviTZi2gEkYIYTHCSGQo953Mzs.jpg"},{"air_date":"1968-04-01","overview":"","episode_count":236,"name":"Season 6","season_number":6,"id":9308,"poster_path":"\/8diYOwkiAFYVZAqduhEhJH6ACeZ.jpg"},{"air_date":"1969-03-03","overview":"","episode_count":182,"name":"Season 7","season_number":7,"id":9303,"poster_path":"\/6EKnVty0bxFYB9RECxb0FjbHfJE.jpg"},{"air_date":"1969-11-14","overview":"","episode_count":92,"name":"Season 8","season_number":8,"id":9302,"poster_path":"\/iJmV8z6XYaGcZQKbgOihRMMig7y.jpg"},{"air_date":"1970-03-30","overview":"","episode_count":79,"name":"Season 9","season_number":9,"id":9305,"poster_path":"\/ev2owfQdhgvAGvczDKyZCNok3EI.jpg"},{"air_date":"1970-07-20","overview":"","episode_count":49,"name":"Season 10","season_number":10,"id":9307,"poster_path":"\/1trP8fqSaFwHoH0VRVTF1dBDRNz.jpg"},{"air_date":"1970-09-25","overview":"","episode_count":85,"name":"Season 11","season_number":11,"id":9301,"poster_path":"\/aRUqoIyLId52v5lV83L60XzT9CN.jpg"},{"air_date":"1971-01-28","overview":"","episode_count":46,"name":"Season 12","season_number":12,"id":9306,"poster_path":"\/zEGYF01qNhnSj9UgBFZuGbCTiAe.jpg"}],"rating":6.5,"serieType":[18,10765,10766],"id":2883,"title":"Dark Shadows"},{"summary":"An anthology horror drama series centering on different characters and locations, including a house with a murderous past, an asylum, a witch coven, a freak show, a hotel, a farmhouse in Roanoke and a cult.","date":"2011-10-05","imageLink":"\/zheiOgPKDMvYjrCSrMLv8FSNJn4.jpg","seasons":[{"air_date":"2011-10-05","overview":"When the Harmon family relocates to a stately mansion in Los Angeles, disturbing secrets start enveloping each of their lives. As they slowly learn about the mysterious and deadly history of their new house, psychiatrist Ben, Vivien and their teenage daughter Violet find themselves surrounded by all manner of menacing spirits, living and dead.","episode_count":12,"name":"Murder House","season_number":1,"id":3700,"poster_path":"\/n7qB6yELp8k4tW4SalLLl7dC923.jpg"},{"air_date":"2012-10-17","overview":"From Nazis and serial killers, to mutants and aliens, no one is safe inside the walls of the Briarcliff Mental Institution. In a house of healing that’s anything but, troubled nun Sister Jude rules with an iron fist and Dr Arden conducts strange experiments on the facility’s patients.","episode_count":13,"name":"Asylum","season_number":2,"id":3702,"poster_path":"\/kLANmrQIepV5KLySxipyVoScPDv.jpg"},{"air_date":"2013-10-09","overview":"The few remaining Salem descendants are under assault by forces of ignorance and hate. The young witches seek refuge at Miss Robichaux's Academy in New Orleans, including new arrival, Zoe, who harbors a terrifying secret of her own. Fiona, a Supreme Witch with unimaginable powers, is determined to protect the Coven, but her obsessive quest for immortality will lead her to cross paths with a voodoo queen and a murderous slave owner cursed with eternal life.","episode_count":13,"name":"Coven","season_number":3,"id":3703,"poster_path":"\/1BJl98sCwzlsr9E29YGL7ped1Tk.jpg"},{"air_date":"2014-10-08","overview":"In 1952, in the quiet, sleepy hamlet of Jupiter, Florida, a troupe of human \"curiosities\" has just arrived to town, coinciding with the strange emergence of a dark entity that savagely threatens the lives of townsfolk and freaks alike.","episode_count":13,"name":"Freak Show","season_number":4,"id":62526,"poster_path":"\/otnQl7MisDB7L7T9MMNj4aTbGFe.jpg"},{"air_date":"2015-10-07","overview":"Homicide detective John Lowe traces a series of grisly murders back to the stylish Hotel Cortez in Downtown Los Angeles and its infamous residents.","episode_count":12,"name":"Hotel","season_number":5,"id":69193,"poster_path":"\/bjCQKHlYrmxmUsv8FdnhqzxogeI.jpg"},{"air_date":"2016-09-14","overview":"After a disturbing incident, a young couple move into a seemingly perfect home built in the 18th century. However, the building's close proximity to the site of the Lost Colony's disappearance and with horrific events happening at the house the couple start to sense something dark underneath the facade.","episode_count":10,"name":"Roanoke","season_number":6,"id":78479,"poster_path":"\/bnU8Bee9H3JF15xoaZr48H3HpuP.jpg"},{"air_date":"2017-09-05","overview":"Set just after the 2016 U.S. presidential election, the seventh installment follows a community torn apart by a dangerous cult leader who uses fear as a weapon.","episode_count":11,"name":"Cult","season_number":7,"id":90503,"poster_path":"\/gwSzP1cJL2HsBmGStN2vOg3d4Qd.jpg"},{"air_date":"2018-09-12","overview":"Worlds collide as Murder House and Coven come together for season 8.","episode_count":6,"name":"Apocalypse","season_number":8,"id":106028,"poster_path":"\/3Ua0MOkXe5kSJKRDMerDMAMjXKx.jpg"}],"rating":7,"serieType":[18,9648,10765],"id":1413,"title":"American Horror Story"},{"summary":"Set in the fictional college town of Hilltowne, Charmed follows the lives of three sisters, Macy, Mel and Maggie Vera who, after the tragic death of their mother, discover they are three of the most powerful witches of all time.","date":"2018-10-14","imageLink":"\/2mUnSzLSacxCvZSEeDRimYFvCwB.jpg","seasons":[{"air_date":"2018-10-14","overview":"","episode_count":4,"name":"Season 1","season_number":1,"id":103911,"poster_path":"\/xjkDN6xdKLCQXxZFvcZj65p3KtC.jpg"}],"rating":2.8,"serieType":[18],"id":79611,"title":"Charmed"},{"summary":"Set in the present, the series offers a bold, subversive take on Archie, Betty, Veronica and their friends, exploring the surreality of small-town life, the darkness and weirdness bubbling beneath Riverdale’s wholesome facade.","date":"2017-01-26","imageLink":"\/1TsbOTztAJtzTRXAhoLsX9a83XX.jpg","seasons":[{"air_date":"2017-01-26","overview":"","episode_count":13,"name":"Season 1","season_number":1,"id":82752,"poster_path":"\/iyLxqUGwOUurAKMOR8hSXmxMISU.jpg"},{"air_date":"2017-10-11","overview":"","episode_count":22,"name":"Season 2","season_number":2,"id":91793,"poster_path":"\/yrsTz3PAUyKmLaNxvNOGX9alubu.jpg"},{"air_date":"2018-10-10","overview":"","episode_count":4,"name":"Season 3","season_number":3,"id":105507,"poster_path":"\/2db35F0vEE7xsBqrYU94dT15A5a.jpg"}],"rating":7.2,"serieType":[18,9648],"id":69050,"title":"Riverdale"}]
